{
  "name": "Swipe: CompTIA Security+ & CySA+ (EN)",
  "version": "1.0.0",
  "created": "2026-02-08",
  "meta": {
    "language": "en",
    "mode": "swipe",
    "source": "Generated by AI Assistant (current, CompTIA Security+/CySA+ focus)",
    "distribution": "50% true, 50% false",
    "difficulty_distribution": "30% easy, 40% medium, 30% hard",
    "authors": ["Generated by AI Assistant"]
  },
  "fragen": [
    {
      "id": "S001",
      "frage": "Symmetric encryption uses the same key to encrypt and decrypt data.",
      "antworten": [
        { "id": "S001-R", "text": "True", "korrekt": true },
        { "id": "S001-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Examples of symmetric methods are AES and DES. In contrast, asymmetric encryption uses a key pair (Public/Private Key).",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S002",
      "frage": "The `nmap` tool is primarily used for analyzing log files on a compromised system.",
      "antworten": [
        { "id": "S002-R", "text": "True", "korrekt": false },
        { "id": "S002-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — `nmap` is a powerful network scanner for discovering hosts and open ports. For analyzing log files, tools like `grep`, `awk` or SIEM systems (e.g., Splunk) are more commonly used.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S003",
      "frage": "A computer worm needs a host file (e.g., an infected program) to spread across a network.",
      "antworten": [
        { "id": "S003-R", "text": "True", "korrekt": false },
        { "id": "S003-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — That is the definition of a virus. A worm is a standalone piece of malware that propagates independently over network vulnerabilities, without being attached to another file.",
      "kategorie": "Malware Types",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S004",
      "frage": "'Threat Hunting' is a proactive process where analysts actively search for signs of compromise that have been missed by automated systems.",
      "antworten": [
        { "id": "S004-R", "text": "True", "korrekt": true },
        { "id": "S004-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Instead of just reacting to alerts, threat hunters assume the network is already compromised and systematically search for anomalies and hidden attackers. A core topic of CySA+.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S005",
      "frage": "A stateful firewall examines each data packet in isolation, without considering the connection context.",
      "antworten": [
        { "id": "S005-R", "text": "True", "korrekt": false },
        { "id": "S005-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — That describes a stateless firewall. A stateful firewall maintains a state table of active connections and can thus distinguish legitimate response traffic from unwanted packets, which increases security.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S006",
      "frage": "Multi-Factor Authentication (MFA) always combines two different passwords to increase security.",
      "antworten": [
        { "id": "S006-R", "text": "True", "korrekt": false },
        { "id": "S006-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — MFA combines at least two different *factors*: Something you know (password), something you have (token, phone), and something you are (biometrics). Two passwords would only be one factor (knowledge).",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S007",
      "frage": "Hashing is an irreversible process that generates a unique, fixed-size value (hash value) from an input.",
      "antworten": [
        { "id": "S007-R", "text": "True", "korrekt": true },
        { "id": "S007-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Hash functions (e.g., SHA-256) are used to verify data integrity or to securely store passwords. A hash value cannot be converted back to the original input.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S008",
      "frage": "An Intrusion Detection System (IDS) is capable of actively blocking attacks.",
      "antworten": [
        { "id": "S008-R", "text": "True", "korrekt": false },
        { "id": "S008-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — An IDS (Intrusion Detection System) detects and reports attacks, but does not actively intervene. An IPS (Intrusion Prevention System), on the other hand, is capable of blocking attacks.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S009",
      "frage": "A rootkit is a type of malware that allows attackers to gain control of a system by replacing or modifying legitimate system files to hide their presence.",
      "antworten": [
        { "id": "S009-R", "text": "True", "korrekt": true },
        { "id": "S009-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Rootkits are particularly dangerous because they make it difficult to detect the compromise by manipulating system tools to not display the hidden malware.",
      "kategorie": "Malware Types",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S010",
      "frage": "A zero-day exploit is an attack that exploits a known vulnerability for which a patch is already available.",
      "antworten": [
        { "id": "S010-R", "text": "True", "korrekt": false },
        { "id": "S010-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A zero-day exploit takes advantage of a vulnerability that the software manufacturer (and thus the users) do not yet know about or for which no patch is available. This makes them particularly dangerous.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S011",
      "frage": "The Principle of Least Privilege states that users and processes should only be granted the minimum necessary access rights to perform their tasks.",
      "antworten": [
        { "id": "S011-R", "text": "True", "korrekt": true },
        { "id": "S011-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! This security principle minimizes the potential for damage that can result from unauthorized access or account compromise.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S012",
      "frage": "A Distributed Denial of Service (DDoS) attack aims to compromise the confidentiality of data.",
      "antworten": [
        { "id": "S012-R", "text": "True", "korrekt": false },
        { "id": "S012-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A DDoS attack aims to impair the availability of a service or system by flooding it with excessive traffic. Confidentiality is not the primary goal.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S013",
      "frage": "The Advanced Encryption Standard (AES) is an asymmetric encryption method.",
      "antworten": [
        { "id": "S013-R", "text": "True", "korrekt": false },
        { "id": "S013-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — AES is a widely used and very secure symmetric encryption method. Asymmetric methods use different keys for encryption and decryption, such as RSA.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S014",
      "frage": "A Security Information and Event Management (SIEM) system collects and analyzes security alerts and log data from various sources.",
      "antworten": [
        { "id": "S014-R", "text": "True", "korrekt": true },
        { "id": "S014-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! SIEM systems are crucial for central monitoring of security events, threat detection, and compliance in large IT environments.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S015",
      "frage": "Adware is a form of malware designed exclusively to display unsolicited advertisements.",
      "antworten": [
        { "id": "S015-R", "text": "True", "korrekt": true },
        { "id": "S015-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Adware itself is not always malicious, but it can be annoying and is often bundled with spyware or other malicious functions.",
      "kategorie": "Malware Types",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S016",
      "frage": "The 'Kill Chain' model describes the typical phases of a cyber attack from reconnaissance to execution.",
      "antworten": [
        { "id": "S016-R", "text": "True", "korrekt": true },
        { "id": "S016-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! The Lockheed Martin Cyber Kill Chain model is a framework that structures the different steps of an attacker. It helps security analysts to understand attacks and develop countermeasures.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S017",
      "frage": "A Single Sign-On (SSO) system increases security by requiring a separate login for each application.",
      "antworten": [
        { "id": "S017-R", "text": "True", "korrekt": false },
        { "id": "S017-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — SSO allows users to log in once and access multiple applications and services without re-authenticating. This simplifies the user experience and can increase security when implemented correctly.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S018",
      "frage": "An Intrusion Prevention System (IPS) is a reactive security measure that only reports attacks.",
      "antworten": [
        { "id": "S018-R", "text": "True", "korrekt": false },
        { "id": "S018-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — An IPS (Intrusion Prevention System) is a proactive security measure that not only detects attacks but also actively blocks or stops them. An IDS (Intrusion Detection System) only reports attacks.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S019",
      "frage": "Digital Rights Management (DRM) is primarily used to improve data security through strong encryption.",
      "antworten": [
        { "id": "S019-R", "text": "True", "korrekt": false },
        { "id": "S019-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — DRM (Digital Rights Management) aims to control and restrict the use of digital content, not primarily to improve data security in terms of confidentiality or integrity.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S020",
      "frage": "A honeypot is a computer system that serves as a decoy for attackers to study their tactics, techniques, and procedures (TTPs).",
      "antworten": [
        { "id": "S020-R", "text": "True", "korrekt": true },
        { "id": "S020-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Honeypots are valuable tools in the field of threat intelligence. They are designed to attract attackers in order to analyze their methods and improve one's own defense.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S021",
      "frage": "A Trojan is a type of malware that self-replicates and spreads over networks.",
      "antworten": [
        { "id": "S021-R", "text": "True", "korrekt": false },
        { "id": "S021-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — The description fits a worm. A Trojan (Trojan Horse) disguises itself as useful software to trick users into installing it, but does not self-replicate.",
      "kategorie": "Malware Types",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S022",
      "frage": "The 'Vulnerability Management' process includes the continuous identification, assessment, and remediation of security vulnerabilities in systems and applications.",
      "antworten": [
        { "id": "S022-R", "text": "True", "korrekt": true },
        { "id": "S022-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! This is a fundamental part of any comprehensive security program to minimize the attack surface.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S023",
      "frage": "Role-Based Access Control (RBAC) assigns permissions directly to individual users.",
      "antworten": [
        { "id": "S023-R", "text": "True", "korrekt": false },
        { "id": "S023-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — RBAC assigns permissions to roles, and users are assigned to these roles. This simplifies the management of large user groups and ensures consistency.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S024",
      "frage": "A Data Loss Prevention (DLP) system is designed to protect data from leaving the network in an undesirable way.",
      "antworten": [
        { "id": "S024-R", "text": "True", "korrekt": true },
        { "id": "S024-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! DLP solutions identify, monitor, and protect sensitive data to prevent its loss, misuse, or unauthorized access, whether at rest, in motion, or in use.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S025",
      "frage": "The Diffie-Hellman key exchange is used to symmetrically encrypt data.",
      "antworten": [
        { "id": "S025-R", "text": "True", "korrekt": false },
        { "id": "S025-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — Diffie-Hellman is a method for securely exchanging keys over an insecure channel. The actual data encryption is then usually done symmetrically with the exchanged key.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S026",
      "frage": "An Endpoint Detection and Response (EDR) system focuses exclusively on detecting network attacks.",
      "antworten": [
        { "id": "S026-R", "text": "True", "korrekt": false },
        { "id": "S026-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — EDR systems focus on endpoints (workstations, servers) to detect, investigate, and respond to threats. They complement traditional network security solutions.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S027",
      "frage": "Ransomware is a type of malware that encrypts files and demands a ransom for their decryption.",
      "antworten": [
        { "id": "S027-R", "text": "True", "korrekt": true },
        { "id": "S027-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Ransomware is one of the most common and damaging forms of malware and poses a major threat to businesses and individuals.",
      "kategorie": "Malware Types",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S028",
      "frage": "The 'MITRE ATT&CK' framework documents known tactics, techniques, and procedures of attackers.",
      "antworten": [
        { "id": "S028-R", "text": "True", "korrekt": true },
        { "id": "S028-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! It is a globally accessible knowledge base of the attack methods of real threat actors and serves as a basis for developing specific detection and defense measures.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S029",
      "frage": "Physical Access Control (PAC) refers exclusively to the biometric authentication of users on systems.",
      "antworten": [
        { "id": "S029-R", "text": "True", "korrekt": false },
        { "id": "S029-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — Physical Access Control (PAC) refers to the control of physical access to buildings, rooms, or data centers, e.g., through key cards, locks, security guards, cameras. Biometrics is just one *type* of authentication.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S030",
      "frage": "A demilitarized zone (DMZ) is a network segment that serves to completely isolate internal network resources from the internet.",
      "antworten": [
        { "id": "S030-R", "text": "True", "korrekt": false },
        { "id": "S030-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A DMZ is a smaller, isolated subnet located between the internal network and the internet. It hosts publicly accessible servers (e.g., web servers) to protect them from direct attacks on the internal network.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S031",
      "frage": "Asymmetric encryption (public-key cryptography) uses a key pair: a public and a private key.",
      "antworten": [
        { "id": "S031-R", "text": "True", "korrekt": true },
        { "id": "S031-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! The public key can be freely distributed, while the private key must be kept secret. Data encrypted with one key can only be decrypted with the other.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S032",
      "frage": "A vulnerability scanner actively and automatically identifies all existing vulnerabilities in a system and fixes them directly.",
      "antworten": [
        { "id": "S032-R", "text": "True", "korrekt": false },
        { "id": "S032-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A vulnerability scanner identifies and assesses vulnerabilities, but does not fix them itself. Remediation (patching, configuration changes) must be done manually or by other systems.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S033",
      "frage": "Spyware is malware that secretly collects information about user activities and sends it to third parties.",
      "antworten": [
        { "id": "S033-R", "text": "True", "korrekt": true },
        { "id": "S033-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Spyware can record keystrokes (keyloggers), monitor browsing behavior, or take screenshots, often without the user's knowledge or consent.",
      "kategorie": "Malware Types",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S034",
      "frage": "The 'Risk Acceptance' approach means that all identified risks must be remediated immediately.",
      "antworten": [
        { "id": "S034-R", "text": "True", "korrekt": false },
        { "id": "S034-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — 'Risk Acceptance' means that a risk is consciously accepted, often because the cost of remediation exceeds the potential damage or the risk is considered low. It is one of the four strategies in risk management.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S035",
      "frage": "Attribute-Based Access Control (ABAC) grants access based on predefined user roles.",
      "antworten": [
        { "id": "S035-R", "text": "True", "korrekt": false },
        { "id": "S035-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — ABAC (Attribute-Based Access Control) grants access based on a dynamic evaluation of attributes (properties) of the user, resource, environment, and action. RBAC (Role-Based Access Control) uses roles.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S036",
      "frage": "A Web Application Firewall (WAF) protects web servers from general network attacks like DDoS.",
      "antworten": [
        { "id": "S036-R", "text": "True", "korrekt": false },
        { "id": "S036-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A WAF is specifically designed to protect web applications from Layer 7 attacks (e.g., SQL Injection, Cross-Site Scripting). General DDoS attacks are more likely to be defended against by network firewalls or specialized DDoS protection services.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S037",
      "frage": "A digital certificate confirms the identity of a user or website and is issued by a Certificate Authority (CA).",
      "antworten": [
        { "id": "S037-R", "text": "True", "korrekt": true },
        { "id": "S037-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Digital certificates are a cornerstone of the Public Key Infrastructure (PKI) and enable secure communication over insecure channels (e.g., HTTPS).",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S038",
      "frage": "A Security Orchestration, Automation and Response (SOAR) system is primarily used for collecting log data from the network.",
      "antworten": [
        { "id": "S038-R", "text": "True", "korrekt": false },
        { "id": "S038-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — SOAR systems automate and orchestrate the response to security incidents. They integrate various security tools to optimize workflows and reduce response times. Collecting log data is more the task of a SIEM system.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S039",
      "frage": "Phishing is a type of social engineering that attempts to obtain sensitive information through deception, often via fake emails.",
      "antworten": [
        { "id": "S039-R", "text": "True", "korrekt": true },
        { "id": "S039-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Phishing remains one of the most effective attack vectors because it exploits human weakness. Awareness training is an important countermeasure.",
      "kategorie": "Social Engineering",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S040",
      "frage": "The 'Cyber Threat Intelligence (CTI)' concept focuses exclusively on technical Indicators of Compromise (IoCs).",
      "antworten": [
        { "id": "S040-R", "text": "True", "korrekt": false },
        { "id": "S040-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — CTI includes not only technical IoCs (like hashes or IP addresses) but also information about attackers (TTPs), their motivation, and capabilities. There are different levels of CTI: tactical, operational, and strategic.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S041",
      "frage": "Discretionary Access Control (DAC) is a centralized access model where an administrator sets all access rights.",
      "antworten": [
        { "id": "S041-R", "text": "True", "korrekt": false },
        { "id": "S041-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — In DAC, the owner of a resource (e.g., a file) can decide for themselves who can access it. It is a decentralized model. Mandatory Access Control (MAC) is a centralized model.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S042",
      "frage": "Network Access Control (NAC) ensures that only authorized devices and users get access to a network, and only to what is necessary.",
      "antworten": [
        { "id": "S042-R", "text": "True", "korrekt": true },
        { "id": "S042-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! NAC solutions can authenticate devices when they connect to the network, check their compliance, and dynamically assign or deny access based on policies.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S043",
      "frage": "The Advanced Encryption Standard (AES) is a block cipher.",
      "antworten": [
        { "id": "S043-R", "text": "True", "korrekt": true },
        { "id": "S043-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! AES encrypts and decrypts data in fixed blocks of 128 bits. In contrast, stream ciphers operate on individual bits or bytes.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S044",
      "frage": "The `whois` command is used to find open ports on a remote host.",
      "antworten": [
        { "id": "S044-R", "text": "True", "korrekt": false },
        { "id": "S044-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — `whois` is used to query information about domain names, IP addresses, and their respective registrants. To find open ports, `nmap` or `netcat` is used.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S045",
      "frage": "Pretexting is a type of social engineering where an attacker invents a plausible but false story (pretext) to obtain information.",
      "antworten": [
        { "id": "S045-R", "text": "True", "korrekt": true },
        { "id": "S045-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! The attacker plays a role to build trust or feign an emergency. Examples include calls as IT support or bank employees.",
      "kategorie": "Social Engineering",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S046",
      "frage": "A penetration test is a passive process that exclusively identifies vulnerabilities in systems.",
      "antworten": [
        { "id": "S046-R", "text": "True", "korrekt": false },
        { "id": "S046-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A penetration test is an active process that attempts to exploit vulnerabilities to assess the actual vulnerability of a system. It goes beyond mere identification.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S047",
      "frage": "Biometric authentication is always based on something the user knows (e.g., a password).",
      "antworten": [
        { "id": "S047-R", "text": "True", "korrekt": false },
        { "id": "S047-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — Biometric authentication is based on something the user *is* (e.g., fingerprint, facial recognition). This is one of the three main factors of authentication (knowledge, possession, inherence).",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S048",
      "frage": "A load balancer distributes network traffic evenly across multiple servers to improve availability and performance.",
      "antworten": [
        { "id": "S048-R", "text": "True", "korrekt": true },
        { "id": "S048-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Load balancers are crucial for the scalability and resilience of web applications and services. They can also perform SSL/TLS offloading.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S049",
      "frage": "A digital signature is used to ensure the confidentiality of a message.",
      "antworten": [
        { "id": "S049-R", "text": "True", "korrekt": false },
        { "id": "S049-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A digital signature ensures the *integrity* (message has not been altered) and *authenticity* (sender is genuine) of a message, as well as *non-repudiation*. Confidentiality is achieved through encryption.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S050",
      "frage": "A Security Information and Event Management (SIEM) system automatically generates patches for identified vulnerabilities.",
      "antworten": [
        { "id": "S050-R", "text": "True", "korrekt": false },
        { "id": "S050-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — SIEM systems collect, correlate, and analyze log data and events to generate security alerts. Remediation of vulnerabilities (patching) is not their core function, but the task of vulnerability management and patch management.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S051",
      "frage": "Spear phishing is a targeted phishing attack on a specific person or organization.",
      "antworten": [
        { "id": "S051-R", "text": "True", "korrekt": true },
        { "id": "S051-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Unlike generic phishing, spear phishing attacks are often well-researched and personalized to increase the success rate.",
      "kategorie": "Social Engineering",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S052",
      "frage": "A Security Incident Response Plan (SIRP) is a document that describes the steps for recovery after a physical data loss.",
      "antworten": [
        { "id": "S052-R", "text": "True", "korrekt": false },
        { "id": "S052-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A SIRP describes the systematic procedure for security incidents (e.g., cyber attacks), from detection through containment to recovery. A Disaster Recovery Plan (DRP) or Business Continuity Plan (BCP) deals with recovery after data loss.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S053",
      "frage": "The five-phase process of incident response is identification, containment, eradication, recovery, and lessons learned.",
      "antworten": [
        { "id": "S053-R", "text": "True", "korrekt": true },
        { "id": "S053-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! This process, often following NIST (National Institute of Standards and Technology), is a standard framework for managing security incidents. Sometimes 'preparation' is added as a zeroth step.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S054",
      "frage": "The Two-Person Rule is a security principle that states that a critical task must always be performed by at least two people simultaneously.",
      "antworten": [
        { "id": "S054-R", "text": "True", "korrekt": true },
        { "id": "S054-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! This increases security and reduces the risk of fraud or errors, as one person can monitor the other. Often used in combination with 'Separation of Duties'.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S055",
      "frage": "A Web Application Firewall (WAF) operates at the Network Layer (Layer 3) of the OSI model.",
      "antworten": [
        { "id": "S055-R", "text": "True", "korrekt": false },
        { "id": "S055-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A WAF operates at the Application Layer (Layer 7) of the OSI model. It understands HTTP/HTTPS communication and can detect and block specific web attacks.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S056",
      "frage": "The SHA-256 algorithm is a cryptographic encryption method.",
      "antworten": [
        { "id": "S056-R", "text": "True", "korrekt": false },
        { "id": "S056-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — SHA-256 is a cryptographic hash function, not an encryption method. It generates a hash value to verify data integrity, but the data cannot be recovered from the hash value.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S057",
      "frage": "A Digital Forensics Workstation should always be connected to the internet to get current tools and threat intelligence.",
      "antworten": [
        { "id": "S057-R", "text": "True", "korrekt": false },
        { "id": "S057-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A Digital Forensics Workstation should ideally be isolated from the network (Air Gap) to ensure the integrity of the evidence and prevent possible compromise during analysis.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S058",
      "frage": "Vishing is a form of phishing that uses voice communication (phone calls) to deceive victims.",
      "antworten": [
        { "id": "S058-R", "text": "True", "korrekt": true },
        { "id": "S058-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! It is a combination of 'voice' and 'phishing'. Attackers pose as trustworthy individuals (e.g., bank employees) to obtain sensitive information.",
      "kategorie": "Social Engineering",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S059",
      "frage": "A Business Continuity Plan (BCP) focuses primarily on the rapid recovery of IT systems after an outage.",
      "antworten": [
        { "id": "S059-R", "text": "True", "korrekt": false },
        { "id": "S059-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A BCP focuses on maintaining critical business functions during and after an emergency to keep operations running as much as possible. A Disaster Recovery Plan (DRP) deals with the technical recovery of IT systems.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S060",
      "frage": "Single-Factor Authentication (SFA) is the most secure method for authenticating users.",
      "antworten": [
        { "id": "S060-R", "text": "True", "korrekt": false },
        { "id": "S060-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — SFA (e.g., just a password) is the least secure method. Multi-Factor Authentication (MFA) is significantly more secure because it uses multiple independent factors to verify identity.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S061",
      "frage": "A Virtual Private Network (VPN) is used to speed up internet access.",
      "antworten": [
        { "id": "S061-R", "text": "True", "korrekt": false },
        { "id": "S061-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — VPNs are primarily used to create a secure and encrypted connection over an insecure network like the internet. They can even slightly slow down internet access because the data needs to be encrypted.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S062",
      "frage": "Blockchain technology is based on a decentralized, immutable transaction ledger secured by cryptography.",
      "antworten": [
        { "id": "S062-R", "text": "True", "korrekt": true },
        { "id": "S062-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Each 'block' contains a cryptographic reference to the preceding block, making data integrity and manipulation nearly impossible. It is the foundation for cryptocurrencies like Bitcoin.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S063",
      "frage": "A packet analyzer (sniffer) can only capture network traffic if it is installed on the target system.",
      "antworten": [
        { "id": "S063-R", "text": "True", "korrekt": false },
        { "id": "S063-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A packet analyzer like Wireshark can capture network traffic by running in promiscuous mode on a device on the same network segment. It does not need to be installed on the target system.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S064",
      "frage": "A Logic Bomb is a type of malware that is activated when certain conditions are met (e.g., a specific date or a specific action).",
      "antworten": [
        { "id": "S064-R", "text": "True", "korrekt": true },
        { "id": "S064-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Logic bombs can often go undetected until the trigger condition occurs, making them a dangerous threat, e.g., in insider sabotage.",
      "kategorie": "Malware Types",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S065",
      "frage": "A security audit is a one-time review of an organization's security.",
      "antworten": [
        { "id": "S065-R", "text": "True", "korrekt": false },
        { "id": "S065-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — Although a security audit is a snapshot in time, an effective security program requires regular audits and continuous monitoring and improvement of the security posture.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S066",
      "frage": "Multi-Factor Authentication (MFA) is an example of an authentication method that uses 'something you have'.",
      "antworten": [
        { "id": "S066-R", "text": "True", "korrekt": true },
        { "id": "S066-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Examples of 'something you have' are hardware tokens, smart cards, or a smartphone for generating one-time passwords. In combination with a password (something you know), this results in MFA.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S067",
      "frage": "A Packet Filtering Firewall operates at the Application Layer (Layer 7) and can inspect the content of HTTP requests.",
      "antworten": [
        { "id": "S067-R", "text": "True", "korrekt": false },
        { "id": "S067-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A simple packet filter operates at Layer 3 (Network) and Layer 4 (Transport) of the OSI model. It makes decisions based on IP addresses and port numbers. A WAF (Web Application Firewall) operates at Layer 7.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S068",
      "frage": "A brute-force attack is a form of cryptographic attack that attempts to find a key by systematically trying all possible combinations.",
      "antworten": [
        { "id": "S068-R", "text": "True", "korrekt": true },
        { "id": "S068-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Although brute-force theoretically always works, the time required becomes astronomically long for sufficiently long and complex keys, making it impractical in practice.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S069",
      "frage": "The `netstat -an` command on Linux shows active network connections and open ports.",
      "antworten": [
        { "id": "S069-R", "text": "True", "korrekt": true },
        { "id": "S069-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! The '-a' option shows all connections (listening and non-listening), and '-n' shows addresses and port numbers numerically. This is a useful tool for network diagnostics and security analysis.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S070",
      "frage": "Shoulder surfing is a form of social engineering that allows remote snooping of passwords or PINs via cameras.",
      "antworten": [
        { "id": "S070-R", "text": "True", "korrekt": false },
        { "id": "S070-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — Shoulder surfing refers to direct observation, e.g., over the shoulder, while someone enters a password or PIN. Snooping via cameras would be more of a form of surveillance.",
      "kategorie": "Social Engineering",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S071",
      "frage": "A Security Information and Event Management (SIEM) system is primarily responsible for managing physical security incidents.",
      "antworten": [
        { "id": "S071-R", "text": "True", "korrekt": false },
        { "id": "S071-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — SIEM systems are designed for managing cyber security incidents and analyzing digital log data. Physical security incidents are typically handled by other systems or processes.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S072",
      "frage": "The 'Need-to-Know' principle states that every employee should have access to all information to do their job effectively.",
      "antworten": [
        { "id": "S072-R", "text": "True", "korrekt": false },
        { "id": "S072-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — The 'Need-to-Know' principle is a security concept that states that employees should only have access to the information that is absolutely necessary for their specific job, and no more. This minimizes the risk of information leaks.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S073",
      "frage": "An IDS (Intrusion Detection System) is a passive security solution.",
      "antworten": [
        { "id": "S073-R", "text": "True", "korrekt": true },
        { "id": "S073-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! An IDS monitors traffic and generates alerts for suspicious activity, but does not actively intervene in the data traffic. In contrast, an IPS (Intrusion Prevention System) actively blocks attacks.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S074",
      "frage": "Keyloggers are a type of malware that record the user's keystrokes.",
      "antworten": [
        { "id": "S074-R", "text": "True", "korrekt": true },
        { "id": "S074-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Keyloggers are often used to steal passwords, credit card numbers, and other sensitive information. They can be implemented as software or hardware.",
      "kategorie": "Malware Types",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S075",
      "frage": "The cryptographic hash algorithm MD5 is now recommended as secure for verifying data integrity.",
      "antworten": [
        { "id": "S075-R", "text": "True", "korrekt": false },
        { "id": "S075-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — MD5 (Message-Digest Algorithm 5) is considered cryptographically broken due to its vulnerability to collisions (different inputs produce the same hash) and should no longer be used for security purposes such as integrity checking. SHA-256 is a secure alternative.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S076",
      "frage": "A security audit is a comprehensive technical review of a system or network for vulnerabilities and misconfigurations.",
      "antworten": [
        { "id": "S076-R", "text": "True", "korrekt": true },
        { "id": "S076-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! It is a formal, systematic examination to assess compliance with security policies, standards, and best practices. Unlike a pen test, it does not involve active attacks.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S077",
      "frage": "Baiting is a social engineering technique where an attacker prepares physical media (e.g., USB sticks) with malware and places them in public places.",
      "antworten": [
        { "id": "S077-R", "text": "True", "korrekt": true },
        { "id": "S077-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! The attacker's hope is that someone will find the media, plug it into their system out of curiosity, and thus activate the malware. The USB sticks are often labeled with enticing titles.",
      "kategorie": "Social Engineering",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S078",
      "frage": "A Data Owner is the person responsible for the technical implementation and maintenance of security systems.",
      "antworten": [
        { "id": "S078-R", "text": "True", "korrekt": false },
        { "id": "S078-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — The Data Owner is the person (or department) who has business responsibility for the data and makes decisions about its use and classification. Technical responsibility lies with the Data Custodian.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S079",
      "frage": "A bastion host is a specially hardened system that serves as a secure jump point in a network and offers only the absolutely necessary services.",
      "antworten": [
        { "id": "S079-R", "text": "True", "korrekt": true },
        { "id": "S079-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Bastion hosts are often deployed in DMZ areas to ensure a high level of security and to control access to internal networks. They are highly secured and monitored.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S080",
      "frage": "The XOR operator is a fundamental operation in cryptography that can be used for encryption and decryption.",
      "antworten": [
        { "id": "S080-R", "text": "True", "korrekt": true },
        { "id": "S080-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! XOR (Exclusive-Or) is reversible (A XOR B = C, then C XOR B = A) and forms the basis of many simple encryption algorithms like the One-Time Pad, but only provides security if the key is truly random and used only once.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S081",
      "frage": "A Security Information and Event Management (SIEM) system correlates events and logs from various sources to identify threats.",
      "antworten": [
        { "id": "S081-R", "text": "True", "korrekt": true },
        { "id": "S081-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! By correlating events from firewalls, endpoints, servers, and applications, a SIEM can detect attacks that would go unnoticed when looking at individual logs in isolation.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S082",
      "frage": "Smishing is a form of phishing that takes place exclusively over social media.",
      "antworten": [
        { "id": "S082-R", "text": "True", "korrekt": false },
        { "id": "S082-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — Smishing is phishing via SMS (Short Message Service). It is a combination of 'SMS' and 'phishing'.",
      "kategorie": "Social Engineering",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S083",
      "frage": "A Business Impact Analysis (BIA) identifies the most critical business functions and the impact of an outage on these functions.",
      "antworten": [
        { "id": "S083-R", "text": "True", "korrekt": true },
        { "id": "S083-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! The BIA is an essential part of business continuity planning and helps to set recovery priorities by defining recovery objectives (RTO, RPO).",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S084",
      "frage": "Privileged Access Management (PAM) focuses on managing and monitoring normal user accounts.",
      "antworten": [
        { "id": "S084-R", "text": "True", "korrekt": false },
        { "id": "S084-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — PAM focuses on managing and monitoring *privileged* user accounts (e.g., administrators, root), as they pose the greatest threat if compromised.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S085",
      "frage": "A Virtual Local Area Network (VLAN) is a physically separate network segment.",
      "antworten": [
        { "id": "S085-R", "text": "True", "korrekt": false },
        { "id": "S085-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A VLAN is a *logical* separation of network segments within the same physical network (often a switch). Physical separation would require dedicated hardware.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S086",
      "frage": "An SSL/TLS certificate is used to verify the identity of a web server and to encrypt communication.",
      "antworten": [
        { "id": "S086-R", "text": "True", "korrekt": true },
        { "id": "S086-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! When you visit an HTTPS website, the SSL/TLS certificate ensures that you are communicating with the intended server and that your data remains private.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S087",
      "frage": "The `whoami` command on Linux displays the IP address of the current user.",
      "antworten": [
        { "id": "S087-R", "text": "True", "korrekt": false },
        { "id": "S087-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — `whoami` displays the username of the current user. For the system's IP address, one would use commands like `ip addr` or `ifconfig`.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S088",
      "frage": "Whaling is a targeted phishing attack that specifically targets high-ranking executives in an organization.",
      "antworten": [
        { "id": "S088-R", "text": "True", "korrekt": true },
        { "id": "S088-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Also known as CEO fraud or Business Email Compromise (BEC). The attacks are often extremely well-prepared and can cause significant financial damage.",
      "kategorie": "Social Engineering",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S089",
      "frage": "An Incident Response Team (IRT) is responsible for preventive security in the company.",
      "antworten": [
        { "id": "S089-R", "text": "True", "korrekt": false },
        { "id": "S089-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — The IRT (or CSIRT) is responsible for responding to security incidents, i.e., when an incident has *already* occurred. Preventive security is the job of the Security Operations Center (SOC) or the entire security team.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S090",
      "frage": "Least Privilege is a concept where users are granted all access rights by default, and these are manually restricted as needed.",
      "antworten": [
        { "id": "S090-R", "text": "True", "korrekt": false },
        { "id": "S090-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — Least Privilege states that users and processes should only be granted the minimum necessary rights to perform their tasks, by default. Everything else is denied.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S091",
      "frage": "An Intrusion Detection System (IDS) must always be placed inline in the network to analyze traffic.",
      "antworten": [
        { "id": "S091-R", "text": "True", "korrekt": false },
        { "id": "S091-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — An IDS can be placed both inline (in the data path) and out-of-band (via a SPAN port or network tap, for monitoring only). Inline placement is typical for IPS systems.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S092",
      "frage": "Transport Layer Security (TLS) is the successor to SSL and is used for secure communication over computer networks.",
      "antworten": [
        { "id": "S092-R", "text": "True", "korrekt": true },
        { "id": "S092-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! TLS is the protocol behind HTTPS, SMTPS, and other secure communication protocols. It ensures confidentiality, integrity, and authenticity.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S093",
      "frage": "The Metasploit Framework is a tool for performing automated vulnerability scans.",
      "antworten": [
        { "id": "S093-R", "text": "True", "korrekt": false },
        { "id": "S093-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — Metasploit is a powerful framework for penetration testing and exploit development. It is not primarily for scanning, but for exploiting known vulnerabilities and post-exploitation.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S094",
      "frage": "A watering hole attack aims to compromise the email accounts of a target group.",
      "antworten": [
        { "id": "S094-R", "text": "True", "korrekt": false },
        { "id": "S094-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — A watering hole attack compromises a website frequently visited by the target group in order to infect the victims when they visit the prepared site. It's like an ambush at the 'watering hole'.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S095",
      "frage": "A Security Information and Event Management (SIEM) system automatically generates patches for identified vulnerabilities.",
      "antworten": [
        { "id": "S095-R", "text": "True", "korrekt": false },
        { "id": "S095-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — SIEM systems collect, correlate, and analyze log data and events to generate security alerts. Remediation of vulnerabilities (patching) is not their core function, but the task of vulnerability management and patch management.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S096",
      "frage": "Separation of Duties is a security principle that prevents a single person from executing a critical task.",
      "antworten": [
        { "id": "S096-R", "text": "True", "korrekt": true },
        { "id": "S096-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! This reduces the risk of fraud, errors, and abuse of privileges by dividing critical tasks into multiple steps that must be performed by different people.",
      "kategorie": "Identity & Access Management",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S097",
      "frage": "An Endpoint Detection and Response (EDR) system provides comprehensive protection against malware on endpoints.",
      "antworten": [
        { "id": "S097-R", "text": "True", "korrekt": true },
        { "id": "S097-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! EDR systems go beyond traditional antivirus protection by continuously monitoring activities on endpoints, detecting threats, responding to them, and providing analysis.",
      "kategorie": "Network Security",
      "lang": "en",
      "schwierigkeit": "medium"
    },
    {
      "id": "S098",
      "frage": "The Kerberos authentication service is based on a symmetric encryption method.",
      "antworten": [
        { "id": "S098-R", "text": "True", "korrekt": true },
        { "id": "S098-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! Kerberos uses symmetric keys for authentication and to secure communication between client and server. It is a widely used network authentication protocol.",
      "kategorie": "Cryptography",
      "lang": "en",
      "schwierigkeit": "hard"
    },
    {
      "id": "S099",
      "frage": "The `ls -la` command on Linux displays all files, including hidden files, and their permissions.",
      "antworten": [
        { "id": "S099-R", "text": "True", "korrekt": true },
        { "id": "S099-F", "text": "False", "korrekt": false }
      ],
      "erklaerung": "True! This is a fundamental command for examining file systems and permissions, often used in security analysis to find suspicious or hidden files.",
      "kategorie": "Security Tools",
      "lang": "en",
      "schwierigkeit": "easy"
    },
    {
      "id": "S100",
      "frage": "In digital forensics, modification of evidence is allowed to speed up the analysis process.",
      "antworten": [
        { "id": "S100-R", "text": "True", "korrekt": false },
        { "id": "S100-F", "text": "False", "korrekt": true }
      ],
      "erklaerung": "False — The integrity of evidence is of utmost importance in digital forensics. Any modification is strictly forbidden and can invalidate the chain of custody. An exact copy (forensic image) must be created and analyzed.",
      "kategorie": "Threat Management",
      "lang": "en",
      "schwierigkeit": "medium"
    }
  ]
}
