{
  "name": "Swipe: CompTIA Security+ & CySA+ (DE)",
  "version": "1.0.0",
  "created": "2026-02-08",
  "meta": {
    "language": "de",
    "mode": "swipe",
    "source": "Generated by AI Assistant (aktuell, CompTIA Security+/CySA+ Fokus)",
    "distribution": "50% richtig, 50% falsch",
    "difficulty_distribution": "30% leicht, 40% mittel, 30% schwer",
    "authors": ["Generated by AI Assistant"]
  },
  "fragen": [
    {
      "id": "S001",
      "frage": "Symmetrische Verschlüsselung verwendet denselben Schlüssel zum Ver- und Entschlüsseln von Daten.",
      "antworten": [
        { "id": "S001-R", "text": "Richtig", "korrekt": true },
        { "id": "S001-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Beispiele für symmetrische Verfahren sind AES und DES. Im Gegensatz dazu verwendet die asymmetrische Verschlüsselung ein Schlüsselpaar (Public/Private Key).",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S002",
      "frage": "Das Tool `nmap` wird primär zur Analyse von Log-Dateien auf einem kompromittierten System verwendet.",
      "antworten": [
        { "id": "S002-R", "text": "Richtig", "korrekt": false },
        { "id": "S002-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — `nmap` ist ein mächtiger Netzwerk-Scanner zum Entdecken von Hosts und offenen Ports. Zur Analyse von Log-Dateien werden eher Tools wie `grep`, `awk` oder SIEM-Systeme (z.B. Splunk) verwendet.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S003",
      "frage": "Ein Computerwurm benötigt eine Wirtsdatei (z.B. ein infiziertes Programm), um sich im Netzwerk zu verbreiten.",
      "antworten": [
        { "id": "S003-R", "text": "Richtig", "korrekt": false },
        { "id": "S003-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Das ist die Definition eines Virus. Ein Wurm ist eine eigenständige Malware, die sich selbstständig über Netzwerkschwachstellen verbreitet, ohne an eine andere Datei gebunden zu sein.",
      "kategorie": "Malware-Typen",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S004",
      "frage": "'Threat Hunting' ist ein proaktiver Prozess, bei dem Analysten aktiv nach Anzeichen einer Kompromittierung suchen, die von automatisierten Systemen übersehen wurden.",
      "antworten": [
        { "id": "S004-R", "text": "Richtig", "korrekt": true },
        { "id": "S004-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Anstatt nur auf Alarme zu reagieren, gehen Threat Hunter von der Annahme aus, dass das Netzwerk bereits kompromittiert ist, und suchen systematisch nach Anomalien und versteckten Angreifern. Ein Kernthema von CySA+.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S005",
      "frage": "Eine Stateful-Firewall untersucht jedes Datenpaket isoliert, ohne den Verbindungskontext zu berücksichtigen.",
      "antworten": [
        { "id": "S005-R", "text": "Richtig", "korrekt": false },
        { "id": "S005-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Das beschreibt eine Stateless-Firewall. Eine Stateful-Firewall führt eine Zustandstabelle über aktive Verbindungen und kann so legitimen Antwortverkehr von unerwünschten Paketen unterscheiden, was die Sicherheit erhöht.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S006",
      "frage": "Multi-Faktor-Authentifizierung (MFA) kombiniert immer zwei verschiedene Passwörter zur Erhöhung der Sicherheit.",
      "antworten": [
        { "id": "S006-R", "text": "Richtig", "korrekt": false },
        { "id": "S006-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — MFA kombiniert mindestens zwei unterschiedliche *Faktoren*: Etwas, das man weiß (Passwort), etwas, das man hat (Token, Handy) und etwas, das man ist (Biometrie). Zwei Passwörter wären nur ein Faktor (Wissen).",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S007",
      "frage": "Hashing ist ein irreversibler Prozess, der aus einer Eingabe einen eindeutigen, festen Wert (Hash-Wert) erzeugt.",
      "antworten": [
        { "id": "S007-R", "text": "Richtig", "korrekt": true },
        { "id": "S007-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Hash-Funktionen (z.B. SHA-256) werden verwendet, um die Integrität von Daten zu überprüfen oder Passwörter sicher zu speichern. Ein Hash-Wert kann nicht zurück in die ursprüngliche Eingabe umgewandelt werden.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S008",
      "frage": "Ein Intrusion Detection System (IDS) ist in der Lage, Angriffe aktiv zu blockieren.",
      "antworten": [
        { "id": "S008-R", "text": "Richtig", "korrekt": false },
        { "id": "S008-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein IDS (Intrusion Detection System) erkennt Angriffe und meldet sie, greift aber nicht aktiv ein. Ein IPS (Intrusion Prevention System) ist hingegen in der Lage, Angriffe zu blockieren.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S009",
      "frage": "Ein Rootkit ist eine Art von Malware, die es Angreifern ermöglicht, die Kontrolle über ein System zu erlangen, indem sie legitime Systemdateien ersetzt oder modifiziert, um ihre Präsenz zu verbergen.",
      "antworten": [
        { "id": "S009-R", "text": "Richtig", "korrekt": true },
        { "id": "S009-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Rootkits sind besonders gefährlich, da sie es schwierig machen, die Kompromittierung zu entdecken, indem sie Systemwerkzeuge manipulieren, um die versteckte Malware nicht anzuzeigen.",
      "kategorie": "Malware-Typen",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S010",
      "frage": "Ein Zero-Day-Exploit ist ein Angriff, der eine bekannte Schwachstelle ausnutzt, für die bereits ein Patch verfügbar ist.",
      "antworten": [
        { "id": "S010-R", "text": "Richtig", "korrekt": false },
        { "id": "S010-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein Zero-Day-Exploit nutzt eine Schwachstelle aus, die der Softwarehersteller (und damit auch die Nutzer) noch nicht kennen oder für die noch kein Patch verfügbar ist. Dies macht sie besonders gefährlich.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S011",
      "frage": "Das Prinzip der geringsten Rechte (Principle of Least Privilege) besagt, dass Benutzer und Prozesse nur die minimal notwendigen Zugriffsrechte erhalten sollten, um ihre Aufgaben zu erfüllen.",
      "antworten": [
        { "id": "S011-R", "text": "Richtig", "korrekt": true },
        { "id": "S011-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Dieses Sicherheitsprinzip minimiert das Potenzial für Schäden, die durch unbefugten Zugriff oder durch Kompromittierung von Konten entstehen können.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S012",
      "frage": "Ein Distributed Denial of Service (DDoS)-Angriff zielt darauf ab, die Vertraulichkeit von Daten zu kompromittieren.",
      "antworten": [
        { "id": "S012-R", "text": "Richtig", "korrekt": false },
        { "id": "S012-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein DDoS-Angriff zielt darauf ab, die Verfügbarkeit eines Dienstes oder Systems zu beeinträchtigen, indem es mit übermäßigem Datenverkehr überflutet wird. Die Vertraulichkeit ist nicht das Primärziel.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S013",
      "frage": "Der Advanced Encryption Standard (AES) ist ein asymmetrisches Verschlüsselungsverfahren.",
      "antworten": [
        { "id": "S013-R", "text": "Richtig", "korrekt": false },
        { "id": "S013-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — AES ist ein weit verbreitetes und sehr sicheres symmetrisches Verschlüsselungsverfahren. Asymmetrische Verfahren verwenden unterschiedliche Schlüssel zum Ver- und Entschlüsseln, wie z.B. RSA.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S014",
      "frage": "Ein Security Information and Event Management (SIEM)-System sammelt und analysiert Sicherheitswarnungen und Log-Daten aus verschiedenen Quellen.",
      "antworten": [
        { "id": "S014-R", "text": "Richtig", "korrekt": true },
        { "id": "S014-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! SIEM-Systeme sind entscheidend für die zentrale Überwachung von Sicherheitsevents, die Erkennung von Bedrohungen und die Einhaltung von Compliance-Vorschriften in großen IT-Umgebungen.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S015",
      "frage": "Adware ist eine Form von Malware, die ausschließlich dazu dient, unaufgeforderte Werbung anzuzeigen.",
      "antworten": [
        { "id": "S015-R", "text": "Richtig", "korrekt": true },
        { "id": "S015-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Adware selbst ist nicht immer schädlich, kann aber lästig sein und oft mit Spyware oder anderen bösartigen Funktionen gebündelt sein.",
      "kategorie": "Malware-Typen",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S016",
      "frage": "Das 'Kill Chain'-Modell beschreibt die typischen Phasen eines Cyberangriffs von der Aufklärung bis zur Durchführung.",
      "antworten": [
        { "id": "S016-R", "text": "Richtig", "korrekt": true },
        { "id": "S016-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Das Lockheed Martin Cyber Kill Chain-Modell ist ein Rahmenwerk, das die verschiedenen Schritte eines Angreifers strukturiert. Es hilft Sicherheitsanalysten, Angriffe zu verstehen und Abwehrmaßnahmen zu entwickeln.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S017",
      "frage": "Ein Single Sign-On (SSO)-System erhöht die Sicherheit, indem es für jede Anwendung ein separates Login erfordert.",
      "antworten": [
        { "id": "S017-R", "text": "Richtig", "korrekt": false },
        { "id": "S017-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — SSO ermöglicht es Benutzern, sich einmal anzumelden und auf mehrere Anwendungen und Dienste zuzugreifen, ohne sich erneut authentifizieren zu müssen. Dies vereinfacht die Benutzererfahrung und kann die Sicherheit erhöhen, wenn es richtig implementiert wird.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S018",
      "frage": "Ein Intrusion Prevention System (IPS) ist eine reaktive Sicherheitsmaßnahme, die Angriffe nur meldet.",
      "antworten": [
        { "id": "S018-R", "text": "Richtig", "korrekt": false },
        { "id": "S018-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein IPS (Intrusion Prevention System) ist eine proaktive Sicherheitsmaßnahme, die Angriffe nicht nur erkennt, sondern auch aktiv blockiert oder stoppt. Ein IDS (Intrusion Detection System) meldet Angriffe nur.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S019",
      "frage": "Digital Rights Management (DRM) wird hauptsächlich zur Verbesserung der Datensicherheit durch starke Verschlüsselung verwendet.",
      "antworten": [
        { "id": "S019-R", "text": "Richtig", "korrekt": false },
        { "id": "S019-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — DRM (Digital Rights Management) zielt darauf ab, die Nutzung digitaler Inhalte zu kontrollieren und zu beschränken, nicht primär die Datensicherheit im Sinne von Vertraulichkeit oder Integrität zu verbessern.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S020",
      "frage": "Ein Honeypot ist ein Computersystem, das als Köder für Angreifer dient, um deren Taktiken, Techniken und Vorgehensweisen (TTPs) zu studieren.",
      "antworten": [
        { "id": "S020-R", "text": "Richtig", "korrekt": true },
        { "id": "S020-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Honeypots sind wertvolle Werkzeuge im Bereich der Threat Intelligence. Sie sollen Angreifer anlocken, um ihre Methoden zu analysieren und die eigene Verteidigung zu verbessern.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S021",
      "frage": "Ein Trojaner ist eine Art von Malware, die sich selbstständig repliziert und über Netzwerke verbreitet.",
      "antworten": [
        { "id": "S021-R", "text": "Richtig", "korrekt": false },
        { "id": "S021-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Die Beschreibung passt zu einem Wurm. Ein Trojaner (Trojanisches Pferd) tarnt sich als nützliche Software, um Benutzer dazu zu verleiten, ihn zu installieren, repliziert sich aber nicht selbst.",
      "kategorie": "Malware-Typen",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S022",
      "frage": "Der 'Vulnerability Management'-Prozess umfasst die kontinuierliche Identifizierung, Bewertung und Behebung von Sicherheitslücken in Systemen und Anwendungen.",
      "antworten": [
        { "id": "S022-R", "text": "Richtig", "korrekt": true },
        { "id": "S022-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Dies ist ein grundlegender Bestandteil eines jeden umfassenden Sicherheitsprogramms, um die Angriffsfläche zu minimieren.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S023",
      "frage": "Role-Based Access Control (RBAC) weist Berechtigungen direkt einzelnen Benutzern zu.",
      "antworten": [
        { "id": "S023-R", "text": "Richtig", "korrekt": false },
        { "id": "S023-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — RBAC weist Berechtigungen Rollen zu, und Benutzer werden diesen Rollen zugewiesen. Dies vereinfacht die Verwaltung großer Benutzergruppen und sorgt für Konsistenz.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S024",
      "frage": "Ein Data Loss Prevention (DLP)-System ist darauf ausgelegt, Daten auf unerwünschte Weise vor dem Verlassen des Netzwerks zu schützen.",
      "antworten": [
        { "id": "S024-R", "text": "Richtig", "korrekt": true },
        { "id": "S024-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! DLP-Lösungen identifizieren, überwachen und schützen sensible Daten, um deren Verlust, Missbrauch oder unbefugten Zugriff zu verhindern, ob im Ruhezustand, in Bewegung oder im Gebrauch.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S025",
      "frage": "Der Diffie-Hellman-Schlüsselaustausch wird verwendet, um Daten symmetrisch zu verschlüsseln.",
      "antworten": [
        { "id": "S025-R", "text": "Richtig", "korrekt": false },
        { "id": "S025-F", "korrekt": true }
      ],
      "erklaerung": "Falsch — Diffie-Hellman ist ein Verfahren zum sicheren Schlüsselaustausch über einen ungesicherten Kanal. Die eigentliche Datenverschlüsselung erfolgt danach meist symmetrisch mit dem ausgetauschten Schlüssel.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S026",
      "frage": "Ein Endpoint Detection and Response (EDR)-System konzentriert sich ausschließlich auf die Erkennung von Netzwerkangriffen.",
      "antworten": [
        { "id": "S026-R", "text": "Richtig", "korrekt": false },
        { "id": "S026-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — EDR-Systeme konzentrieren sich auf die Endpunkte (Workstations, Server), um Bedrohungen zu erkennen, zu untersuchen und darauf zu reagieren. Sie ergänzen traditionelle Netzwerksicherheitslösungen.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S027",
      "frage": "Ransomware ist eine Art von Malware, die Dateien verschlüsselt und ein Lösegeld für deren Entschlüsselung fordert.",
      "antworten": [
        { "id": "S027-R", "text": "Richtig", "korrekt": true },
        { "id": "S027-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Ransomware ist eine der häufigsten und schädlichsten Formen von Malware und stellt eine große Bedrohung für Unternehmen und Einzelpersonen dar.",
      "kategorie": "Malware-Typen",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S028",
      "frage": "Das 'MITRE ATT&CK'-Framework dokumentiert bekannte Taktiken, Techniken und Vorgehensweisen von Angreifern.",
      "antworten": [
        { "id": "S028-R", "text": "Richtig", "korrekt": true },
        { "id": "S028-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Es ist ein global zugängliches Wissensarchiv über die Angriffsmethoden realer Bedrohungsakteure und dient als Grundlage für die Entwicklung spezifischer Erkennungs- und Abwehrmaßnahmen.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S029",
      "frage": "Physical Access Control (PAC) bezieht sich ausschließlich auf die biometrische Authentifizierung von Benutzern an Systemen.",
      "antworten": [
        { "id": "S029-R", "text": "Richtig", "korrekt": false },
        { "id": "S029-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Physical Access Control (PAC) bezieht sich auf die Kontrolle des physischen Zugangs zu Gebäuden, Räumen oder Rechenzentren, z.B. durch Schlüsselkarten, Schlösser, Wachpersonal, Kameras. Biometrie ist nur eine *Art* der Authentifizierung.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S030",
      "frage": "Ein demilitarisierte Zone (DMZ) ist ein Netzwerksegment, das dazu dient, interne Netzwerkressourcen vollständig vor dem Internet zu isolieren.",
      "antworten": [
        { "id": "S030-R", "text": "Richtig", "korrekt": false },
        { "id": "S030-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Eine DMZ ist ein kleineres, isoliertes Subnetz, das sich zwischen dem internen Netzwerk und dem Internet befindet. Es beherbergt öffentlich zugängliche Server (z.B. Webserver), die so vor direkten Angriffen auf das interne Netzwerk geschützt sind.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S031",
      "frage": "Asymmetrische Verschlüsselung (Public-Key-Kryptographie) verwendet ein Schlüsselpaar: einen öffentlichen und einen privaten Schlüssel.",
      "antworten": [
        { "id": "S031-R", "text": "Richtig", "korrekt": true },
        { "id": "S031-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Der öffentliche Schlüssel kann frei verteilt werden, während der private Schlüssel geheim gehalten werden muss. Daten, die mit dem einen Schlüssel verschlüsselt wurden, können nur mit dem anderen entschlüsselt werden.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S032",
      "frage": "Ein Vulnerability Scanner (Schwachstellen-Scanner) identifiziert aktiv und automatisch alle bestehenden Schwachstellen in einem System und behebt sie auch direkt.",
      "antworten": [
        { "id": "S032-R", "text": "Richtig", "korrekt": false },
        { "id": "S032-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein Schwachstellen-Scanner identifiziert und bewertet Schwachstellen, behebt sie aber nicht selbst. Die Behebung (Patching, Konfigurationsänderung) muss manuell oder durch andere Systeme erfolgen.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S033",
      "frage": "Spyware ist Malware, die heimlich Informationen über Benutzeraktivitäten sammelt und an Dritte sendet.",
      "antworten": [
        { "id": "S033-R", "text": "Richtig", "korrekt": true },
        { "id": "S033-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Spyware kann Tastatureingaben aufzeichnen (Keylogger), Browsing-Verhalten überwachen oder Screenshots erstellen, oft ohne Wissen oder Zustimmung des Benutzers.",
      "kategorie": "Malware-Typen",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S034",
      "frage": "Der 'Risk Acceptance'-Ansatz bedeutet, dass alle identifizierten Risiken umgehend behoben werden müssen.",
      "antworten": [
        { "id": "S034-R", "text": "Richtig", "korrekt": false },
        { "id": "S034-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — 'Risk Acceptance' (Risikoakzeptanz) bedeutet, dass ein Risiko bewusst akzeptiert wird, oft weil die Kosten für die Behebung den potenziellen Schaden übersteigen oder das Risiko als gering eingestuft wird. Es ist eine der vier Strategien im Risikomanagement.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S035",
      "frage": "Attribute-Based Access Control (ABAC) gewährt Zugriff basierend auf vordefinierten Benutzerrollen.",
      "antworten": [
        { "id": "S035-R", "text": "Richtig", "korrekt": false },
        { "id": "S035-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — ABAC (Attribute-Based Access Control) gewährt Zugriff basierend auf einer dynamischen Auswertung von Attributen (Eigenschaften) von Benutzer, Ressource, Umgebung und Aktion. RBAC (Role-Based Access Control) verwendet Rollen.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S036",
      "frage": "Ein Web Application Firewall (WAF) schützt Webserver vor allgemeinen Netzwerkangriffen wie DDoS.",
      "antworten": [
        { "id": "S036-R", "text": "Richtig", "korrekt": false },
        { "id": "S036-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Eine WAF ist speziell dafür konzipiert, Webanwendungen vor Layer-7-Angriffen zu schützen (z.B. SQL Injection, Cross-Site Scripting). Allgemeine DDoS-Angriffe werden eher von Netzwerk-Firewalls oder spezialisierten DDoS-Schutzdiensten abgewehrt.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S037",
      "frage": "Ein Digitales Zertifikat bestätigt die Identität eines Benutzers oder einer Website und wird von einer Zertifizierungsstelle (CA) ausgestellt.",
      "antworten": [
        { "id": "S037-R", "text": "Richtig", "korrekt": true },
        { "id": "S037-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Digitale Zertifikate sind ein Eckpfeiler der Public Key Infrastructure (PKI) und ermöglichen sichere Kommunikation über unsichere Kanäle (z.B. HTTPS).",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S038",
      "frage": "Ein Security Orchestration, Automation and Response (SOAR)-System dient primär der Erfassung von Log-Daten aus dem Netzwerk.",
      "antworten": [
        { "id": "S038-R", "text": "Richtig", "korrekt": false },
        { "id": "S038-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — SOAR-Systeme automatisieren und orchestrieren die Reaktion auf Sicherheitsvorfälle. Sie integrieren verschiedene Sicherheitstools, um Workflows zu optimieren und Reaktionszeiten zu verkürzen. Die Erfassung von Log-Daten ist eher Aufgabe eines SIEM-Systems.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S039",
      "frage": "Phishing ist eine Art von Social Engineering, bei der versucht wird, vertrauliche Informationen durch Täuschung zu erlangen, oft über gefälschte E-Mails.",
      "antworten": [
        { "id": "S039-R", "text": "Richtig", "korrekt": true },
        { "id": "S039-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Phishing bleibt eine der effektivsten Angriffsvektoren, da es die menschliche Schwäche ausnutzt. Schulungen zur Sensibilisierung sind eine wichtige Gegenmaßnahme.",
      "kategorie": "Social Engineering",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S040",
      "frage": "Das 'Cyber Threat Intelligence (CTI)'-Konzept konzentriert sich ausschließlich auf technische Indicators of Compromise (IoCs).",
      "antworten": [
        { "id": "S040-R", "text": "Richtig", "korrekt": false },
        { "id": "S040-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — CTI umfasst nicht nur technische IoCs (wie Hashes oder IP-Adressen), sondern auch Informationen über Angreifer (TTPs), deren Motivation und Fähigkeiten. Es gibt verschiedene Level von CTI: taktisch, operativ und strategisch.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S041",
      "frage": "Discretionary Access Control (DAC) ist ein zentralisiertes Zugriffsmodell, bei dem ein Administrator alle Zugriffsrechte festlegt.",
      "antworten": [
        { "id": "S041-R", "text": "Richtig", "korrekt": false },
        { "id": "S041-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Bei DAC kann der Eigentümer einer Ressource (z.B. einer Datei) selbst entscheiden, wer darauf zugreifen darf. Es ist ein dezentrales Modell. Mandatory Access Control (MAC) ist ein zentralisiertes Modell.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S042",
      "frage": "Network Access Control (NAC) stellt sicher, dass nur autorisierte Geräte und Benutzer Zugang zu einem Netzwerk erhalten, und zwar nur auf das Nötigste.",
      "antworten": [
        { "id": "S042-R", "text": "Richtig", "korrekt": true },
        { "id": "S042-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! NAC-Lösungen können Geräte beim Verbindungsaufbau zum Netzwerk authentifizieren, deren Compliance überprüfen und den Zugriff basierend auf Richtlinien dynamisch zuweisen oder verweigern.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S043",
      "frage": "Der Advanced Encryption Standard (AES) ist ein Blockchiffre.",
      "antworten": [
        { "id": "S043-R", "text": "Richtig", "korrekt": true },
        { "id": "S043-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! AES ver- und entschlüsselt Daten in festen Blöcken von 128 Bit. Im Gegensatz dazu arbeiten Stromchiffren mit einzelnen Bits oder Bytes.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S044",
      "frage": "Der Befehl `whois` dient dazu, offene Ports auf einem Remote-Host zu finden.",
      "antworten": [
        { "id": "S044-R", "text": "Richtig", "korrekt": false },
        { "id": "S044-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — `whois` wird verwendet, um Informationen über Domainnamen, IP-Adressen und die jeweiligen Registranten abzufragen. Zum Auffinden offener Ports wird `nmap` oder `netcat` verwendet.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S045",
      "frage": "Pretexting ist eine Art von Social Engineering, bei der ein Angreifer eine plausible, aber falsche Geschichte (Pretext) erfindet, um an Informationen zu gelangen.",
      "antworten": [
        { "id": "S045-R", "text": "Richtig", "korrekt": true },
        { "id": "S045-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Der Angreifer spielt eine Rolle, um Vertrauen aufzubauen oder eine Notlage vorzutäuschen. Beispiele sind Anrufe als IT-Support oder Bankmitarbeiter.",
      "kategorie": "Social Engineering",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S046",
      "frage": "Ein Penetrationstest ist ein passiver Prozess, der ausschließlich Schwachstellen in Systemen identifiziert.",
      "antworten": [
        { "id": "S046-R", "text": "Richtig", "korrekt": false },
        { "id": "S046-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein Penetrationstest ist ein aktiver Prozess, bei dem versucht wird, Schwachstellen auszunutzen, um die tatsächliche Angreifbarkeit eines Systems zu bewerten. Er geht über die bloße Identifizierung hinaus.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S047",
      "frage": "Biometrische Authentifizierung basiert immer auf etwas, das der Benutzer weiß (z.B. Passwort).",
      "antworten": [
        { "id": "S047-R", "text": "Richtig", "korrekt": false },
        { "id": "S047-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Biometrische Authentifizierung basiert auf etwas, das der Benutzer *ist* (z.B. Fingerabdruck, Gesichtserkennung). Das ist einer der drei Hauptfaktoren der Authentifizierung (Wissen, Besitz, Sein).",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S048",
      "frage": "Ein Load Balancer verteilt den Netzwerkverkehr gleichmäßig auf mehrere Server, um die Verfügbarkeit und Performance zu verbessern.",
      "antworten": [
        { "id": "S048-R", "text": "Richtig", "korrekt": true },
        { "id": "S048-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Load Balancer sind entscheidend für die Skalierbarkeit und Ausfallsicherheit von Webanwendungen und Diensten. Sie können auch SSL/TLS-Offloading durchführen.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S049",
      "frage": "Ein Digitaler Signatur wird verwendet, um die Vertraulichkeit einer Nachricht zu gewährleisten.",
      "antworten": [
        { "id": "S049-R", "text": "Richtig", "korrekt": false },
        { "id": "S049-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Eine digitale Signatur gewährleistet die *Integrität* (Nachricht wurde nicht verändert) und die *Authentizität* (Absender ist echt) einer Nachricht, sowie die *Nicht-Abstreitbarkeit*. Vertraulichkeit wird durch Verschlüsselung erreicht.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S050",
      "frage": "Ein Security Information and Event Management (SIEM)-System generiert automatisch Patches für identifizierte Schwachstellen.",
      "antworten": [
        { "id": "S050-R", "text": "Richtig", "korrekt": false },
        { "id": "S050-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — SIEM-Systeme sammeln, korrelieren und analysieren Log-Daten und Events, um Sicherheitswarnungen zu generieren. Die Behebung von Schwachstellen (Patching) ist nicht ihre Kernfunktion, sondern die Aufgabe des Vulnerability Management und Patch Management.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S051",
      "frage": "Spear Phishing ist ein gezielter Phishing-Angriff auf eine bestimmte Person oder Organisation.",
      "antworten": [
        { "id": "S051-R", "text": "Richtig", "korrekt": true },
        { "id": "S051-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Im Gegensatz zu generischem Phishing sind Spear-Phishing-Angriffe oft gut recherchiert und persönlich zugeschnitten, um die Erfolgsquote zu erhöhen.",
      "kategorie": "Social Engineering",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S052",
      "frage": "Ein Security Incident Response Plan (SIRP) ist ein Dokument, das die Schritte zur Wiederherstellung nach einem physischen Datenverlust beschreibt.",
      "antworten": [
        { "id": "S052-R", "text": "Richtig", "korrekt": false },
        { "id": "S052-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein SIRP beschreibt die systematische Vorgehensweise bei Sicherheitsvorfällen (z.B. Cyberangriffe), von der Erkennung über die Eindämmung bis zur Wiederherstellung. Ein Disaster Recovery Plan (DRP) oder Business Continuity Plan (BCP) behandelt die Wiederherstellung nach Datenverlust.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S053",
      "frage": "Der Fünf-Phasen-Prozess der Incident Response ist Identifikation, Eindämmung, Ausrottung, Wiederherstellung, Nachbereitung.",
      "antworten": [
        { "id": "S053-R", "text": "Richtig", "korrekt": true },
        { "id": "S053-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Dieser Prozess, oft nach NIST (National Institute of Standards and Technology), ist ein Standardrahmenwerk für das Management von Sicherheitsvorfällen. Manchmal wird 'Vorbereitung' als nullter Schritt hinzugefügt.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S054",
      "frage": "Die Zwei-Personen-Regel (Two-Person Rule) ist ein Sicherheitsprinzip, das besagt, dass eine kritische Aufgabe immer von mindestens zwei Personen gleichzeitig ausgeführt werden muss.",
      "antworten": [
        { "id": "S054-R", "text": "Richtig", "korrekt": true },
        { "id": "S054-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Dies erhöht die Sicherheit und reduziert das Risiko von Betrug oder Fehlern, da eine Person die andere überwachen kann. Oft in Kombination mit 'Separation of Duties' (Funktionstrennung).",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S055",
      "frage": "Ein Web Application Firewall (WAF) arbeitet auf der Netzwerkschicht (Schicht 3) des OSI-Modells.",
      "antworten": [
        { "id": "S055-R", "text": "Richtig", "korrekt": false },
        { "id": "S055-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Eine WAF arbeitet auf der Anwendungsschicht (Schicht 7) des OSI-Modells. Sie versteht die HTTP/HTTPS-Kommunikation und kann spezifische Webangriffe erkennen und blockieren.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S056",
      "frage": "Der SHA-256 Algorithmus ist ein kryptographisches Verschlüsselungsverfahren.",
      "antworten": [
        { "id": "S056-R", "text": "Richtig", "korrekt": false },
        { "id": "S056-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — SHA-256 ist eine kryptographische Hash-Funktion, kein Verschlüsselungsverfahren. Sie erzeugt einen Hash-Wert zur Überprüfung der Datenintegrität, aber die Daten können nicht aus dem Hash-Wert wiederhergestellt werden.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S057",
      "frage": "Ein Digital Forensics Workstation sollte immer mit dem Internet verbunden sein, um aktuelle Tools und Threat Intelligence zu erhalten.",
      "antworten": [
        { "id": "S057-R", "text": "Richtig", "korrekt": false },
        { "id": "S057-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Eine Digital Forensics Workstation sollte idealerweise isoliert vom Netzwerk (Air Gap) betrieben werden, um die Integrität der Beweismittel zu gewährleisten und eine mögliche Kompromittierung während der Analyse zu verhindern.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S058",
      "frage": "Vishing ist eine Form von Phishing, die Sprachkommunikation (Telefonanrufe) nutzt, um Opfer zu täuschen.",
      "antworten": [
        { "id": "S058-R", "text": "Richtig", "korrekt": true },
        { "id": "S058-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Es ist eine Kombination aus 'Voice' und 'Phishing'. Angreifer geben sich als vertrauenswürdige Personen (z.B. Bankmitarbeiter) aus, um sensible Informationen zu erhalten.",
      "kategorie": "Social Engineering",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S059",
      "frage": "Ein Business Continuity Plan (BCP) konzentriert sich primär auf die schnelle Wiederherstellung von IT-Systemen nach einem Ausfall.",
      "antworten": [
        { "id": "S059-R", "text": "Richtig", "korrekt": false },
        { "id": "S059-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein BCP konzentriert sich auf die Aufrechterhaltung kritischer Geschäftsfunktionen während und nach einem Notfall, um den Betrieb so weit wie möglich aufrechtzuerhalten. Ein Disaster Recovery Plan (DRP) befasst sich mit der technischen Wiederherstellung der IT-Systeme.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S060",
      "frage": "Single-Faktor-Authentifizierung (SFA) ist die sicherste Methode zur Authentifizierung von Benutzern.",
      "antworten": [
        { "id": "S060-R", "text": "Richtig", "korrekt": false },
        { "id": "S060-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — SFA (z.B. nur ein Passwort) ist die am wenigsten sichere Methode. Multi-Faktor-Authentifizierung (MFA) ist deutlich sicherer, da sie mehrere unabhängige Faktoren zur Überprüfung der Identität verwendet.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S061",
      "frage": "Ein Virtual Private Network (VPN) wird verwendet, um den Internetzugang zu beschleunigen.",
      "antworten": [
        { "id": "S061-R", "text": "Richtig", "korrekt": false },
        { "id": "S061-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — VPNs werden primär zur Schaffung einer sicheren und verschlüsselten Verbindung über ein unsicheres Netzwerk wie das Internet verwendet. Sie können den Internetzugang sogar leicht verlangsamen, da die Daten verschlüsselt werden müssen.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S062",
      "frage": "Die Blockchain-Technologie basiert auf einem dezentralen, unveränderlichen Transaktionsregister, das durch Kryptographie gesichert ist.",
      "antworten": [
        { "id": "S062-R", "text": "Richtig", "korrekt": true },
        { "id": "S062-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Jeder 'Block' enthält eine kryptographische Referenz zum vorhergehenden Block, was die Datenintegrität und Manipulation nahezu unmöglich macht. Sie ist die Grundlage für Kryptowährungen wie Bitcoin.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S063",
      "frage": "Ein Packet Analyzer (Sniffer) kann den Netzwerkverkehr nur dann erfassen, wenn er auf dem Zielsystem installiert ist.",
      "antworten": [
        { "id": "S063-R", "text": "Richtig", "korrekt": false },
        { "id": "S063-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein Packet Analyzer wie Wireshark kann den Netzwerkverkehr erfassen, indem er im Promiscuous Mode auf einem Gerät im selben Netzwerksegment ausgeführt wird. Er muss nicht auf dem Zielsystem installiert sein.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S064",
      "frage": "Ein Logic Bomb ist eine Art von Malware, die aktiviert wird, wenn bestimmte Bedingungen erfüllt sind (z.B. ein bestimmtes Datum oder eine bestimmte Aktion).",
      "antworten": [
        { "id": "S064-R", "text": "Richtig", "korrekt": true },
        { "id": "S064-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Logic Bombs können oft unentdeckt bleiben, bis die Auslösebedingung eintritt, was sie zu einer gefährlichen Bedrohung macht, z.B. bei der Sabotage durch Insider.",
      "kategorie": "Malware-Typen",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S065",
      "frage": "Ein Security-Audit ist eine einmalige Überprüfung der Sicherheit einer Organisation.",
      "antworten": [
        { "id": "S065-R", "text": "Richtig", "korrekt": false },
        { "id": "S065-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein Security-Audit ist zwar eine Momentaufnahme, aber ein effektives Sicherheitsprogramm erfordert regelmäßige Audits und eine kontinuierliche Überwachung und Verbesserung der Sicherheitslage.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S066",
      "frage": "Multi-Faktor-Authentifizierung (MFA) ist ein Beispiel für ein Authentifizierungsverfahren, das 'etwas, das man hat' nutzt.",
      "antworten": [
        { "id": "S066-R", "text": "Richtig", "korrekt": true },
        { "id": "S066-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Beispiele für 'etwas, das man hat' sind Hardware-Token, Smartcards oder das Smartphone für die Generierung von Einmalpasswörtern. In Kombination mit einem Passwort (etwas, das man weiß) ergibt sich MFA.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S067",
      "frage": "Ein Packet Filtering Firewall arbeitet auf der Anwendungsschicht (Schicht 7) und kann den Inhalt von HTTP-Anfragen untersuchen.",
      "antworten": [
        { "id": "S067-R", "text": "Richtig", "korrekt": false },
        { "id": "S067-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein einfacher Paketfilter arbeitet auf Schicht 3 (Netzwerk) und Schicht 4 (Transport) des OSI-Modells. Er trifft Entscheidungen basierend auf IP-Adressen und Portnummern. Eine WAF (Web Application Firewall) arbeitet auf Schicht 7.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S068",
      "frage": "Ein Brute-Force-Angriff ist eine Form des kryptographischen Angriffs, der versucht, einen Schlüssel durch systematisches Ausprobieren aller möglichen Kombinationen zu finden.",
      "antworten": [
        { "id": "S068-R", "text": "Richtig", "korrekt": true },
        { "id": "S068-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Obwohl Brute-Force theoretisch immer funktioniert, wird die benötigte Zeit bei ausreichend langen und komplexen Schlüsseln astronomisch lang, was sie in der Praxis unbrauchbar macht.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S069",
      "frage": "Der Befehl `netstat -an` unter Linux zeigt aktive Netzwerkverbindungen und offene Ports an.",
      "antworten": [
        { "id": "S069-R", "text": "Richtig", "korrekt": true },
        { "id": "S069-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Die Option '-a' zeigt alle Verbindungen (Listening und Non-Listening), und '-n' zeigt Adressen und Portnummern numerisch an. Dies ist ein nützliches Tool zur Netzwerkdiagnose und Sicherheitsanalyse.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S070",
      "frage": "Shoulder Surfing ist eine Form von Social Engineering, die das Ausspähen von Passwörtern oder PINs aus der Ferne über Kameras ermöglicht.",
      "antworten": [
        { "id": "S070-R", "text": "Richtig", "korrekt": false },
        { "id": "S070-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Shoulder Surfing bezieht sich auf das direkte Beobachten, z.B. über die Schulter, während jemand ein Passwort oder eine PIN eingibt. Das Ausspähen über Kameras wäre eher eine Form der Überwachung.",
      "kategorie": "Social Engineering",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S071",
      "frage": "Ein Security Information and Event Management (SIEM)-System ist primär für das Management von physischen Sicherheitsvorfällen zuständig.",
      "antworten": [
        { "id": "S071-R", "text": "Richtig", "korrekt": false },
        { "id": "S071-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — SIEM-Systeme sind für die Verwaltung von Cyber-Sicherheitsvorfällen und die Analyse von digitalen Log-Daten konzipiert. Physische Sicherheitsvorfälle werden in der Regel von anderen Systemen oder Prozessen behandelt.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S072",
      "frage": "Das 'Need-to-Know'-Prinzip besagt, dass jeder Mitarbeiter Zugang zu allen Informationen haben sollte, um seine Arbeit effektiv zu erledigen.",
      "antworten": [
        { "id": "S072-R", "text": "Richtig", "korrekt": false },
        { "id": "S072-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Das 'Need-to-Know'-Prinzip ist ein Sicherheitskonzept, das besagt, dass Mitarbeiter nur Zugang zu den Informationen erhalten sollen, die für ihre spezifische Aufgabe absolut notwendig sind, und nicht mehr. Dies minimiert das Risiko von Informationslecks.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S073",
      "frage": "Ein IDS (Intrusion Detection System) ist eine Passive Sicherheitslösung.",
      "antworten": [
        { "id": "S073-R", "text": "Richtig", "korrekt": true },
        { "id": "S073-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Ein IDS überwacht den Verkehr und erstellt Alarme bei verdächtigen Aktivitäten, greift aber nicht aktiv in den Datenverkehr ein. Im Gegensatz dazu blockiert ein IPS (Intrusion Prevention System) Angriffe aktiv.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S074",
      "frage": "Keylogger sind eine Art von Malware, die die Eingaben des Benutzers auf der Tastatur aufzeichnen.",
      "antworten": [
        { "id": "S074-R", "text": "Richtig", "korrekt": true },
        { "id": "S074-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Keylogger werden häufig verwendet, um Passwörter, Kreditkartennummern und andere sensible Informationen zu stehlen. Sie können als Software oder Hardware implementiert sein.",
      "kategorie": "Malware-Typen",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S075",
      "frage": "Der kryptographische Hash-Algorithmus MD5 wird heute als sicher für die Überprüfung der Datenintegrität empfohlen.",
      "antworten": [
        { "id": "S075-R", "text": "Richtig", "korrekt": false },
        { "id": "S075-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — MD5 (Message-Digest Algorithm 5) gilt aufgrund seiner Anfälligkeit für Kollisionen (unterschiedliche Eingaben erzeugen denselben Hash) als kryptographisch gebrochen und sollte nicht mehr für Sicherheitszwecke wie die Integritätsprüfung verwendet werden. SHA-256 ist eine sichere Alternative.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S076",
      "frage": "Ein Security-Audit ist eine umfassende technische Überprüfung eines Systems oder Netzwerks auf Schwachstellen und Fehlkonfigurationen.",
      "antworten": [
        { "id": "S076-R", "text": "Richtig", "korrekt": true },
        { "id": "S076-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Es ist eine formelle, systematische Untersuchung, um die Einhaltung von Sicherheitsrichtlinien, Standards und Best Practices zu bewerten. Im Gegensatz zum Pen-Test wird hier nicht aktiv angegriffen.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S077",
      "frage": "Baiting ist eine Social Engineering-Technik, bei der ein Angreifer physische Medien (z.B. USB-Sticks) mit Malware präpariert und an öffentlichen Orten platziert.",
      "antworten": [
        { "id": "S077-R", "text": "Richtig", "korrekt": true },
        { "id": "S077-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Die Hoffnung des Angreifers ist, dass jemand das Medium findet, aus Neugierde an sein System anschließt und so die Malware aktiviert. Oft werden die USB-Sticks mit verlockenden Labels versehen.",
      "kategorie": "Social Engineering",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S078",
      "frage": "Ein Data Owner ist die Person, die für die technische Implementierung und Wartung von Sicherheitssystemen verantwortlich ist.",
      "antworten": [
        { "id": "S078-R", "text": "Richtig", "korrekt": false },
        { "id": "S078-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Der Data Owner (Dateneigentümer) ist die Person (oder Abteilung), die die geschäftliche Verantwortung für die Daten trägt und Entscheidungen über deren Nutzung und Klassifizierung trifft. Die technische Verantwortung liegt beim Data Custodian.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S079",
      "frage": "Ein Bastion Host ist ein speziell gehärtetes System, das als sicherer Sprungpunkt in einem Netzwerk dient und nur die absolut notwendigen Dienste anbietet.",
      "antworten": [
        { "id": "S079-R", "text": "Richtig", "korrekt": true },
        { "id": "S079-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Bastion Hosts werden oft in DMZ-Bereichen eingesetzt, um ein hohes Maß an Sicherheit zu gewährleisten und den Zugriff auf interne Netzwerke zu kontrollieren. Sie sind hochgradig gesichert und überwacht.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S080",
      "frage": "Der XOR-Operator ist eine grundlegende Operation in der Kryptographie, die für Ver- und Entschlüsselung verwendet werden kann.",
      "antworten": [
        { "id": "S080-R", "text": "Richtig", "korrekt": true },
        { "id": "S080-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! XOR (Exklusiv-Oder) ist umkehrbar (A XOR B = C, dann C XOR B = A) und bildet die Basis vieler einfacher Verschlüsselungsalgorithmen wie dem One-Time Pad, bietet aber nur Sicherheit, wenn der Schlüssel wirklich zufällig und nur einmal verwendet wird.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S081",
      "frage": "Ein Security Information and Event Management (SIEM)-System korreliert Events und Logs aus verschiedenen Quellen, um Bedrohungen zu identifizieren.",
      "antworten": [
        { "id": "S081-R", "text": "Richtig", "korrekt": true },
        { "id": "S081-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Durch die Korrelation von Ereignissen aus Firewalls, Endpunkten, Servern und Anwendungen kann ein SIEM Angriffe erkennen, die bei isolierter Betrachtung einzelner Logs unentdeckt blieben.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S082",
      "frage": "Smishing ist eine Form von Phishing, die ausschließlich über soziale Medien stattfindet.",
      "antworten": [
        { "id": "S082-R", "text": "Richtig", "korrekt": false },
        { "id": "S082-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Smishing ist Phishing über SMS (Short Message Service). Es ist eine Kombination aus 'SMS' und 'Phishing'.",
      "kategorie": "Social Engineering",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S083",
      "frage": "Ein Business Impact Analysis (BIA) identifiziert die kritischsten Geschäftsfunktionen und die Auswirkungen eines Ausfalls auf diese Funktionen.",
      "antworten": [
        { "id": "S083-R", "text": "Richtig", "korrekt": true },
        { "id": "S083-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Die BIA ist ein wesentlicher Bestandteil der Business Continuity Planung und hilft dabei, Prioritäten für die Wiederherstellung festzulegen, indem sie Wiederherstellungsziele (RTO, RPO) definiert.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S084",
      "frage": "Privileged Access Management (PAM) konzentriert sich auf die Verwaltung und Überwachung von normalen Benutzerkonten.",
      "antworten": [
        { "id": "S084-R", "text": "Richtig", "korrekt": false },
        { "id": "S084-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — PAM konzentriert sich auf die Verwaltung und Überwachung von *privilegierten* Benutzerkonten (z.B. Administratoren, Root), da diese die größte Bedrohung bei Kompromittierung darstellen.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S085",
      "frage": "Ein Virtual Local Area Network (VLAN) ist ein physisch getrenntes Netzwerksegment.",
      "antworten": [
        { "id": "S085-R", "text": "Richtig", "korrekt": false },
        { "id": "S085-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein VLAN ist eine *logische* Trennung von Netzwerksegmenten innerhalb desselben physischen Netzwerks (oft eines Switches). Physische Trennung würde dedizierte Hardware erfordern.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S086",
      "frage": "Ein SSL/TLS-Zertifikat wird verwendet, um die Identität eines Webservers zu überprüfen und die Kommunikation zu verschlüsseln.",
      "antworten": [
        { "id": "S086-R", "text": "Richtig", "korrekt": true },
        { "id": "S086-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Wenn Sie eine HTTPS-Website besuchen, stellt das SSL/TLS-Zertifikat sicher, dass Sie mit dem beabsichtigten Server kommunizieren und dass Ihre Daten privat bleiben.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S087",
      "frage": "Der Befehl `whoami` unter Linux zeigt die IP-Adresse des aktuellen Benutzers an.",
      "antworten": [
        { "id": "S087-R", "text": "Richtig", "korrekt": false },
        { "id": "S087-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — `whoami` zeigt den Benutzernamen des aktuellen Benutzers an. Für die IP-Adresse des Systems würde man Befehle wie `ip addr` oder `ifconfig` verwenden.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S088",
      "frage": "Whaling ist ein gezielter Phishing-Angriff, der sich speziell an hochrangige Führungskräfte in einer Organisation richtet.",
      "antworten": [
        { "id": "S088-R", "text": "Richtig", "korrekt": true },
        { "id": "S088-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Auch bekannt als CEO Fraud oder Business Email Compromise (BEC). Die Angriffe sind oft extrem gut vorbereitet und können große finanzielle Schäden verursachen.",
      "kategorie": "Social Engineering",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S089",
      "frage": "Ein Incident Response Team (IRT) ist für die präventive Sicherheit im Unternehmen zuständig.",
      "antworten": [
        { "id": "S089-R", "text": "Richtig", "korrekt": false },
        { "id": "S089-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Das IRT (oder CSIRT) ist für die Reaktion auf Sicherheitsvorfälle zuständig, d.h. wenn ein Vorfall *bereits* eingetreten ist. Präventive Sicherheit ist die Aufgabe des Security Operations Center (SOC) oder des gesamten Security-Teams.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S090",
      "frage": "Least Privilege ist ein Konzept, bei dem Benutzer standardmäßig alle Zugriffsrechte erhalten und diese bei Bedarf manuell eingeschränkt werden.",
      "antworten": [
        { "id": "S090-R", "text": "Richtig", "korrekt": false },
        { "id": "S090-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Least Privilege (Prinzip der geringsten Rechte) besagt, dass Benutzer und Prozesse nur die minimal notwendigen Rechte erhalten, um ihre Aufgaben zu erfüllen, und zwar standardmäßig. Alles andere wird verweigert.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S091",
      "frage": "Ein Intrusion Detection System (IDS) muss immer inline im Netzwerk platziert werden, um den Verkehr zu analysieren.",
      "antworten": [
        { "id": "S091-R", "text": "Richtig", "korrekt": false },
        { "id": "S091-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein IDS kann sowohl inline (in den Datenpfad eingefügt) als auch out-of-band (über einen SPAN-Port oder Netzwerk-Tap, nur zur Überwachung) platziert werden. Inline-Platzierung ist typisch für IPS-Systeme.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S092",
      "frage": "Transport Layer Security (TLS) ist der Nachfolger von SSL und wird zur sicheren Kommunikation über Computernetzwerke verwendet.",
      "antworten": [
        { "id": "S092-R", "text": "Richtig", "korrekt": true },
        { "id": "S092-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! TLS ist das Protokoll, das hinter HTTPS, SMTPS und anderen sicheren Kommunikationsprotokollen steckt. Es gewährleistet Vertraulichkeit, Integrität und Authentizität.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S093",
      "frage": "Die Metasploit Framework ist ein Tool zur Durchführung von automatisierten Schwachstellen-Scans.",
      "antworten": [
        { "id": "S093-R", "text": "Richtig", "korrekt": false },
        { "id": "S093-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Metasploit ist ein mächtiges Framework für Penetrationstests und die Entwicklung von Exploits. Es dient nicht primär dem Scannen, sondern dem Ausnutzen bekannter Schwachstellen und der Post-Exploitation.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S094",
      "frage": "Ein Watering Hole-Angriff zielt darauf ab, die E-Mail-Konten einer Zielgruppe zu kompromittieren.",
      "antworten": [
        { "id": "S094-R", "text": "Richtig", "korrekt": false },
        { "id": "S094-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Ein Watering Hole-Angriff kompromittiert eine Website, die von der Zielgruppe häufig besucht wird, um die Opfer dann zu infizieren, wenn sie die präparierte Seite aufrufen. Es ist wie ein Hinterhalt am 'Wasserloch'.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S095",
      "frage": "Ein Security Information and Event Management (SIEM)-System generiert automatisch Patches für identifizierte Schwachstellen.",
      "antworten": [
        { "id": "S095-R", "text": "Richtig", "korrekt": false },
        { "id": "S095-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — SIEM-Systeme sammeln, korrelieren und analysieren Log-Daten und Events, um Sicherheitswarnungen zu generieren. Die Behebung von Schwachstellen (Patching) ist nicht ihre Kernfunktion, sondern die Aufgabe des Vulnerability Management und Patch Management.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S096",
      "frage": "Die Funktionstrennung (Separation of Duties) ist ein Sicherheitsprinzip, das die Ausführung einer kritischen Aufgabe durch eine einzelne Person verhindert.",
      "antworten": [
        { "id": "S096-R", "text": "Richtig", "korrekt": true },
        { "id": "S096-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Dies reduziert das Risiko von Betrug, Fehlern und Missbrauch von Privilegien, indem kritische Aufgaben in mehrere Schritte unterteilt werden, die von verschiedenen Personen ausgeführt werden müssen.",
      "kategorie": "Identitäts- & Zugriffsmanagement",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S097",
      "frage": "Ein Endpoint Detection and Response (EDR)-System bietet einen umfassenden Schutz vor Malware auf Endgeräten.",
      "antworten": [
        { "id": "S097-R", "text": "Richtig", "korrekt": true },
        { "id": "S097-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! EDR-Systeme gehen über traditionellen Antivirenschutz hinaus, indem sie kontinuierlich Aktivitäten auf Endpunkten überwachen, Bedrohungen erkennen, darauf reagieren und Analysen bereitstellen.",
      "kategorie": "Netzwerksicherheit",
      "lang": "de",
      "schwierigkeit": "mittel"
    },
    {
      "id": "S098",
      "frage": "Der Kerberos-Authentifizierungsdienst basiert auf einem symmetrischen Verschlüsselungsverfahren.",
      "antworten": [
        { "id": "S098-R", "text": "Richtig", "korrekt": true },
        { "id": "S098-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Kerberos verwendet symmetrische Schlüssel für die Authentifizierung und zur Sicherung der Kommunikation zwischen Client und Server. Es ist ein weit verbreitetes Netzwerkauthentifizierungsprotokoll.",
      "kategorie": "Kryptographie",
      "lang": "de",
      "schwierigkeit": "schwer"
    },
    {
      "id": "S099",
      "frage": "Der Befehl `ls -la` unter Linux zeigt alle Dateien, einschließlich versteckter Dateien, und deren Berechtigungen an.",
      "antworten": [
        { "id": "S099-R", "text": "Richtig", "korrekt": true },
        { "id": "S099-F", "text": "Falsch", "korrekt": false }
      ],
      "erklaerung": "Stimmt! Dies ist ein grundlegender Befehl zur Untersuchung von Dateisystemen und Berechtigungen, der oft bei der Sicherheitsanalyse verwendet wird, um verdächtige oder versteckte Dateien zu finden.",
      "kategorie": "Sicherheits-Tools",
      "lang": "de",
      "schwierigkeit": "leicht"
    },
    {
      "id": "S100",
      "frage": "Im Rahmen der Forensic Analysis (forensischen Analyse) ist die Veränderung von Beweismitteln zur Beschleunigung des Analyseprozesses erlaubt.",
      "antworten": [
        { "id": "S100-R", "text": "Richtig", "korrekt": false },
        { "id": "S100-F", "text": "Falsch", "korrekt": true }
      ],
      "erklaerung": "Falsch — Die Integrität von Beweismitteln ist in der forensischen Analyse von größter Bedeutung. Jegliche Veränderung ist streng verboten und kann die Beweiskette ungültig machen. Es muss eine exakte Kopie (Forensic Image) erstellt und diese analysiert werden.",
      "kategorie": "Threat Management",
      "lang": "de",
      "schwierigkeit": "mittel"
    }
  ]
}
