{
  "name": "Swipe: CompTIA Security+ & CySA+ (RU)",
  "version": "1.0.0",
  "created": "2026-02-08",
  "meta": {
    "language": "ru",
    "mode": "swipe",
    "source": "Generated by AI Assistant (актуально, CompTIA Security+/CySA+ фокус)",
    "distribution": "50% верно, 50% неверно",
    "difficulty_distribution": "30% легко, 40% средне, 30% сложно",
    "authors": ["Generated by AI Assistant"]
  },
  "fragen": [
    {
      "id": "S001",
      "frage": "Симметричное шифрование использует один и тот же ключ для шифрования и дешифрования данных.",
      "antworten": [
        { "id": "S001-R", "text": "Верно", "korrekt": true },
        { "id": "S001-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Примерами симметричных методов являются AES и DES. В отличие от этого, асимметричное шифрование использует пару ключей (открытый/закрытый ключ).",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S002",
      "frage": "Инструмент `nmap` в основном используется для анализа лог-файлов на скомпрометированной системе.",
      "antworten": [
        { "id": "S002-R", "text": "Верно", "korrekt": false },
        { "id": "S002-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — `nmap` - это мощный сетевой сканер для обнаружения хостов и открытых портов. Для анализа лог-файлов чаще используются такие инструменты, как `grep`, `awk` или системы SIEM (например, Splunk).",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S003",
      "frage": "Компьютерному червю нужен хост-файл (например, зараженная программа), чтобы распространяться по сети.",
      "antworten": [
        { "id": "S003-R", "text": "Верно", "korrekt": false },
        { "id": "S003-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Это определение вируса. Червь - это самостоятельная вредоносная программа, которая распространяется независимо через сетевые уязвимости, не будучи привязанной к другому файлу.",
      "kategorie": "Типы вредоносных программ",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S004",
      "frage": "'Охота на угрозы' (Threat Hunting) - это проактивный процесс, в ходе которого аналитики активно ищут признаки компрометации, которые были пропущены автоматизированными системами.",
      "antworten": [
        { "id": "S004-R", "text": "Верно", "korrekt": true },
        { "id": "S004-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Вместо того, чтобы просто реагировать на оповещения, охотники на угрозы исходят из предположения, что сеть уже скомпрометирована, и систематически ищут аномалии и скрытых злоумышленников. Это основная тема CySA+.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S005",
      "frage": "Межсетевой экран с отслеживанием состояния (Stateful firewall) проверяет каждый пакет данных изолированно, не учитывая контекст соединения.",
      "antworten": [
        { "id": "S005-R", "text": "Верно", "korrekt": false },
        { "id": "S005-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Это описывает межсетевой экран без отслеживания состояния (Stateless firewall). Межсетевой экран с отслеживанием состояния ведет таблицу состояний активных соединений и таким образом может отличать легитимный ответный трафик от нежелательных пакетов, что повышает безопасность.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S006",
      "frage": "Многофакторная аутентификация (MFA) всегда сочетает в себе два разных пароля для повышения безопасности.",
      "antworten": [
        { "id": "S006-R", "text": "Верно", "korrekt": false },
        { "id": "S006-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — MFA сочетает в себе как минимум два разных *фактора*: что-то, что вы знаете (пароль), что-то, что у вас есть (токен, телефон), и что-то, чем вы являетесь (биометрия). Два пароля были бы только одним фактором (знание).",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S007",
      "frage": "Хеширование - это необратимый процесс, который генерирует уникальное значение фиксированного размера (хеш-значение) из входных данных.",
      "antworten": [
        { "id": "S007-R", "text": "Верно", "korrekt": true },
        { "id": "S007-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Хеш-функции (например, SHA-256) используются для проверки целостности данных или для безопасного хранения паролей. Хеш-значение не может быть преобразовано обратно в исходные данные.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S008",
      "frage": "Система обнаружения вторжений (IDS) способна активно блокировать атаки.",
      "antworten": [
        { "id": "S008-R", "text": "Верно", "korrekt": false },
        { "id": "S008-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — IDS (Intrusion Detection System) обнаруживает и сообщает об атаках, но не вмешивается активно. IPS (Intrusion Prevention System), с другой стороны, способна блокировать атаки.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S009",
      "frage": "Руткит - это тип вредоносного ПО, который позволяет злоумышленникам получить контроль над системой путем замены или изменения легитимных системных файлов для сокрытия своего присутствия.",
      "antworten": [
        { "id": "S009-R", "text": "Верно", "korrekt": true },
        { "id": "S009-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Руткиты особенно опасны, потому что они затрудняют обнаружение компрометации, манипулируя системными инструментами, чтобы не отображать скрытое вредоносное ПО.",
      "kategorie": "Типы вредоносных программ",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S010",
      "frage": "Эксплойт нулевого дня - это атака, использующая известную уязвимость, для которой уже доступен патч.",
      "antworten": [
        { "id": "S010-R", "text": "Верно", "korrekt": false },
        { "id": "S010-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Эксплойт нулевого дня использует уязвимость, о которой производитель программного обеспечения (и, следовательно, пользователи) еще не знают или для которой еще нет патча. Это делает их особенно опасными.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S011",
      "frage": "Принцип наименьших привилегий (Principle of Least Privilege) гласит, что пользователи и процессы должны получать только минимально необходимые права доступа для выполнения своих задач.",
      "antworten": [
        { "id": "S011-R", "text": "Верно", "korrekt": true },
        { "id": "S011-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Этот принцип безопасности минимизирует потенциальный ущерб, который может возникнуть в результате несанкционированного доступа или компрометации учетных записей.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S012",
      "frage": "Атака распределенного отказа в обслуживании (DDoS) нацелена на компрометацию конфиденциальности данных.",
      "antworten": [
        { "id": "S012-R", "text": "Верно", "korrekt": false },
        { "id": "S012-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — DDoS-атака нацелена на нарушение доступности службы или системы путем ее переполнения чрезмерным трафиком. Конфиденциальность не является основной целью.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S013",
      "frage": "Advanced Encryption Standard (AES) - это асимметричный метод шифрования.",
      "antworten": [
        { "id": "S013-R", "text": "Верно", "korrekt": false },
        { "id": "S013-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — AES - это широко используемый и очень безопасный симметричный метод шифрования. Асимметричные методы используют разные ключи для шифрования и дешифрования, например, RSA.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S014",
      "frage": "Система управления информацией и событиями безопасности (SIEM) собирает и анализирует предупреждения безопасности и данные журналов из различных источников.",
      "antworten": [
        { "id": "S014-R", "text": "Верно", "korrekt": true },
        { "id": "S014-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Системы SIEM имеют решающее значение для централизованного мониторинга событий безопасности, обнаружения угроз и обеспечения соответствия требованиям в крупных ИТ-средах.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S015",
      "frage": "Adware - это форма вредоносного ПО, предназначенная исключительно для показа нежелательной рекламы.",
      "antworten": [
        { "id": "S015-R", "text": "Верно", "korrekt": true },
        { "id": "S015-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Само по себе рекламное ПО не всегда является вредоносным, но оно может быть назойливым и часто поставляется в комплекте со шпионским ПО или другими вредоносными функциями.",
      "kategorie": "Типы вредоносных программ",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S016",
      "frage": "Модель 'Kill Chain' описывает типичные этапы кибератаки от разведки до выполнения.",
      "antworten": [
        { "id": "S016-R", "text": "Верно", "korrekt": true },
        { "id": "S016-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Модель Lockheed Martin Cyber Kill Chain - это структура, которая структурирует различные шаги злоумышленника. Она помогает аналитикам безопасности понимать атаки и разрабатывать контрмеры.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S017",
      "frage": "Система единого входа (SSO) повышает безопасность, требуя отдельного входа для каждого приложения.",
      "antworten": [
        { "id": "S017-R", "text": "Верно", "korrekt": false },
        { "id": "S017-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — SSO позволяет пользователям войти в систему один раз и получить доступ к нескольким приложениям и службам без повторной аутентификации. Это упрощает работу пользователя и может повысить безопасность при правильной реализации.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S018",
      "frage": "Система предотвращения вторжений (IPS) - это реактивная мера безопасности, которая только сообщает об атаках.",
      "antworten": [
        { "id": "S018-R", "text": "Верно", "korrekt": false },
        { "id": "S018-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — IPS (Intrusion Prevention System) - это проактивная мера безопасности, которая не только обнаруживает атаки, но и активно блокирует или останавливает их. IDS (Intrusion Detection System) только сообщает об атаках.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S019",
      "frage": "Управление цифровыми правами (DRM) в основном используется для повышения безопасности данных за счет сильного шифрования.",
      "antworten": [
        { "id": "S019-R", "text": "Верно", "korrekt": false },
        { "id": "S019-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — DRM (Digital Rights Management) нацелено на контроль и ограничение использования цифрового контента, а не в первую очередь на повышение безопасности данных с точки зрения конфиденциальности или целостности.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S020",
      "frage": "Приманка (Honeypot) - это компьютерная система, которая служит приманкой для злоумышленников с целью изучения их тактик, техник и процедур (TTP).",
      "antworten": [
        { "id": "S020-R", "text": "Верно", "korrekt": true },
        { "id": "S020-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Приманки - это ценные инструменты в области разведки угроз. Они предназначены для привлечения злоумышленников с целью анализа их методов и улучшения собственной защиты.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S021",
      "frage": "Троян - это тип вредоносного ПО, которое самовоспроизводится и распространяется по сетям.",
      "antworten": [
        { "id": "S021-R", "text": "Верно", "korrekt": false },
        { "id": "S021-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Описание подходит для червя. Троян (троянский конь) маскируется под полезное программное обеспечение, чтобы обманом заставить пользователей установить его, но не самовоспроизводится.",
      "kategorie": "Типы вредоносных программ",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S022",
      "frage": "Процесс 'управления уязвимостями' включает в себя постоянное выявление, оценку и устранение уязвимостей безопасности в системах и приложениях.",
      "antworten": [
        { "id": "S022-R", "text": "Верно", "korrekt": true },
        { "id": "S022-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Это фундаментальная часть любой комплексной программы безопасности для минимизации поверхности атаки.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S023",
      "frage": "Управление доступом на основе ролей (RBAC) назначает разрешения непосредственно отдельным пользователям.",
      "antworten": [
        { "id": "S023-R", "text": "Верно", "korrekt": false },
        { "id": "S023-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — RBAC назначает разрешения ролям, а пользователи назначаются этим ролям. Это упрощает управление большими группами пользователей и обеспечивает согласованность.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S024",
      "frage": "Система предотвращения потери данных (DLP) предназначена для защиты данных от нежелательного выхода из сети.",
      "antworten": [
        { "id": "S024-R", "text": "Верно", "korrekt": true },
        { "id": "S024-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Решения DLP идентифицируют, отслеживают и защищают конфиденциальные данные для предотвращения их потери, неправомерного использования или несанкционированного доступа, будь то в состоянии покоя, в движении или в использовании.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S025",
      "frage": "Обмен ключами Диффи-Хеллмана используется для симметричного шифрования данных.",
      "antworten": [
        { "id": "S025-R", "text": "Верно", "korrekt": false },
        { "id": "S025-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Диффи-Хеллман - это метод безопасного обмена ключами по незащищенному каналу. Фактическое шифрование данных затем обычно выполняется симметрично с помощью обмененного ключа.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S026",
      "frage": "Система обнаружения и реагирования на конечных точках (EDR) фокусируется исключительно на обнаружении сетевых атак.",
      "antworten": [
        { "id": "S026-R", "text": "Верно", "korrekt": false },
        { "id": "S026-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Системы EDR фокусируются на конечных точках (рабочих станциях, серверах) для обнаружения, расследования и реагирования на угрозы. Они дополняют традиционные решения сетевой безопасности.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S027",
      "frage": "Вымогательское ПО (Ransomware) - это тип вредоносного ПО, который шифрует файлы и требует выкуп за их расшифровку.",
      "antworten": [
        { "id": "S027-R", "text": "Верно", "korrekt": true },
        { "id": "S027-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Вымогательское ПО является одной из самых распространенных и вредоносных форм вредоносного ПО и представляет собой серьезную угрозу для предприятий и частных лиц.",
      "kategorie": "Типы вредоносных программ",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S028",
      "frage": "Фреймворк 'MITRE ATT&CK' документирует известные тактики, методы и процедуры злоумышленников.",
      "antworten": [
        { "id": "S028-R", "text": "Верно", "korrekt": true },
        { "id": "S028-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Это глобально доступная база знаний о методах атак реальных угроз и служит основой для разработки конкретных мер обнаружения и защиты.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S029",
      "frage": "Физический контроль доступа (PAC) относится исключительно к биометрической аутентификации пользователей в системах.",
      "antworten": [
        { "id": "S029-R", "text": "Верно", "korrekt": false },
        { "id": "S029-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Физический контроль доступа (PAC) относится к контролю физического доступа к зданиям, помещениям или центрам обработки данных, например, с помощью ключ-карт, замков, охранников, камер. Биометрия - это лишь один из *видов* аутентификации.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S030",
      "frage": "Демилитаризованная зона (DMZ) - это сетевой сегмент, который служит для полной изоляции внутренних сетевых ресурсов от Интернета.",
      "antworten": [
        { "id": "S030-R", "text": "Верно", "korrekt": false },
        { "id": "S030-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — DMZ - это небольшая изолированная подсеть, расположенная между внутренней сетью и Интернетом. В ней размещаются общедоступные серверы (например, веб-серверы), чтобы защитить их от прямых атак на внутреннюю сеть.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S031",
      "frage": "Асимметричное шифрование (криптография с открытым ключом) использует пару ключей: открытый и закрытый.",
      "antworten": [
        { "id": "S031-R", "text": "Верно", "korrekt": true },
        { "id": "S031-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Открытый ключ можно свободно распространять, а закрытый ключ должен храниться в секрете. Данные, зашифрованные одним ключом, могут быть расшифрованы только другим.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S032",
      "frage": "Сканер уязвимостей активно и автоматически выявляет все существующие уязвимости в системе и сразу же их устраняет.",
      "antworten": [
        { "id": "S032-R", "text": "Верно", "korrekt": false },
        { "id": "S032-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Сканер уязвимостей выявляет и оценивает уязвимости, но не устраняет их самостоятельно. Устранение (установка исправлений, изменение конфигурации) должно выполняться вручную или другими системами.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S033",
      "frage": "Шпионское ПО - это вредоносное ПО, которое тайно собирает информацию о действиях пользователя и отправляет ее третьим лицам.",
      "antworten": [
        { "id": "S033-R", "text": "Верно", "korrekt": true },
        { "id": "S033-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Шпионское ПО может записывать нажатия клавиш (кейлоггеры), отслеживать поведение в браузере или делать скриншоты, часто без ведома или согласия пользователя.",
      "kategorie": "Типы вредоносных программ",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S034",
      "frage": "Подход 'принятия риска' означает, что все выявленные риски должны быть немедленно устранены.",
      "antworten": [
        { "id": "S034-R", "text": "Верно", "korrekt": false },
        { "id": "S034-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — 'Принятие риска' означает, что риск сознательно принимается, часто потому, что затраты на его устранение превышают потенциальный ущерб или риск считается низким. Это одна из четырех стратегий управления рисками.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S035",
      "frage": "Управление доступом на основе атрибутов (ABAC) предоставляет доступ на основе предопределенных ролей пользователя.",
      "antworten": [
        { "id": "S035-R", "text": "Верно", "korrekt": false },
        { "id": "S035-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — ABAC (Attribute-Based Access Control) предоставляет доступ на основе динамической оценки атрибутов (свойств) пользователя, ресурса, среды и действия. RBAC (Role-Based Access Control) использует роли.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S036",
      "frage": "Брандмауэр веб-приложений (WAF) защищает веб-серверы от общих сетевых атак, таких как DDoS.",
      "antworten": [
        { "id": "S036-R", "text": "Верно", "korrekt": false },
        { "id": "S036-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — WAF специально разработан для защиты веб-приложений от атак на уровне 7 (например, SQL-инъекции, межсайтовый скриптинг). Общие DDoS-атаки скорее отражаются сетевыми брандмауэрами или специализированными службами защиты от DDoS.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S037",
      "frage": "Цифровой сертификат подтверждает личность пользователя или веб-сайта и выдается центром сертификации (CA).",
      "antworten": [
        { "id": "S037-R", "text": "Верно", "korrekt": true },
        { "id": "S037-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Цифровые сертификаты являются краеугольным камнем инфраструктуры открытых ключей (PKI) и обеспечивают безопасную связь по небезопасным каналам (например, HTTPS).",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S038",
      "frage": "Система оркестровки, автоматизации и реагирования на инциденты безопасности (SOAR) в первую очередь используется для сбора данных журналов из сети.",
      "antworten": [
        { "id": "S038-R", "text": "Верно", "korrekt": false },
        { "id": "S038-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Системы SOAR автоматизируют и оркестрируют реагирование на инциденты безопасности. Они интегрируют различные инструменты безопасности для оптимизации рабочих процессов и сокращения времени реагирования. Сбор данных журналов - скорее задача системы SIEM.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S039",
      "frage": "Фишинг - это тип социальной инженерии, при котором предпринимаются попытки получить конфиденциальную информацию путем обмана, часто с помощью поддельных электронных писем.",
      "antworten": [
        { "id": "S039-R", "text": "Верно", "korrekt": true },
        { "id": "S039-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Фишинг остается одним из наиболее эффективных векторов атак, поскольку он использует человеческую слабость. Обучение для повышения осведомленности является важной контрмерой.",
      "kategorie": "Социальная инженерия",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S040",
      "frage": "Концепция 'Cyber Threat Intelligence (CTI)' фокусируется исключительно на технических индикаторах компрометации (IoC).",
      "antworten": [
        { "id": "S040-R", "text": "Верно", "korrekt": false },
        { "id": "S040-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — CTI включает не только технические IoC (такие как хеши или IP-адреса), но и информацию о злоумышленниках (TTP), их мотивации и возможностях. Существуют различные уровни CTI: тактический, оперативный и стратегический.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S041",
      "frage": "Дискреционное управление доступом (DAC) - это централизованная модель доступа, в которой администратор устанавливает все права доступа.",
      "antworten": [
        { "id": "S041-R", "text": "Верно", "korrekt": false },
        { "id": "S041-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — При DAC владелец ресурса (например, файла) может сам решать, кто может к нему обращаться. Это децентрализованная модель. Мандатное управление доступом (MAC) - это централизованная модель.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S042",
      "frage": "Контроль доступа к сети (NAC) гарантирует, что только авторизованные устройства и пользователи получают доступ к сети, и только к самому необходимому.",
      "antworten": [
        { "id": "S042-R", "text": "Верно", "korrekt": true },
        { "id": "S042-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Решения NAC могут аутентифицировать устройства при подключении к сети, проверять их соответствие и динамически назначать или отказывать в доступе на основе политик.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S043",
      "frage": "Advanced Encryption Standard (AES) - это блочный шифр.",
      "antworten": [
        { "id": "S043-R", "text": "Верно", "korrekt": true },
        { "id": "S043-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! AES шифрует и дешифрует данные в фиксированных блоках по 128 бит. В отличие от этого, потоковые шифры работают с отдельными битами или байтами.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S044",
      "frage": "Команда `whois` служит для поиска открытых портов на удаленном хосте.",
      "antworten": [
        { "id": "S044-R", "text": "Верно", "korrekt": false },
        { "id": "S044-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — `whois` используется для запроса информации о доменных именах, IP-адресах и их соответствующих регистрантах. Для поиска открытых портов используется `nmap` или `netcat`.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S045",
      "frage": "Претекстинг - это вид социальной инженерии, при котором злоумышленник выдумывает правдоподобную, но ложную историю (претекст) для получения информации.",
      "antworten": [
        { "id": "S045-R", "text": "Верно", "korrekt": true },
        { "id": "S045-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Злоумышленник играет роль, чтобы завоевать доверие или симулировать чрезвычайную ситуацию. Примерами являются звонки от имени IT-поддержки или банковских служащих.",
      "kategorie": "Социальная инженерия",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S046",
      "frage": "Тестирование на проникновение - это пассивный процесс, который исключительно выявляет уязвимости в системах.",
      "antworten": [
        { "id": "S046-R", "text": "Верно", "korrekt": false },
        { "id": "S046-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Тестирование на проникновение - это активный процесс, при котором предпринимаются попытки использовать уязвимости для оценки фактической уязвимости системы. Он выходит за рамки простого выявления.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S047",
      "frage": "Биометрическая аутентификация всегда основана на чем-то, что пользователь знает (например, пароль).",
      "antworten": [
        { "id": "S047-R", "text": "Верно", "korrekt": false },
        { "id": "S047-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Биометрическая аутентификация основана на чем-то, чем пользователь *является* (например, отпечаток пальца, распознавание лица). Это один из трех основных факторов аутентификации (знание, владение, бытие).",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S048",
      "frage": "Балансировщик нагрузки равномерно распределяет сетевой трафик между несколькими серверами для повышения доступности и производительности.",
      "antworten": [
        { "id": "S048-R", "text": "Верно", "korrekt": true },
        { "id": "S048-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Балансировщики нагрузки имеют решающее значение для масштабируемости и отказоустойчивости веб-приложений и служб. Они также могут выполнять разгрузку SSL/TLS.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S049",
      "frage": "Цифровая подпись используется для обеспечения конфиденциальности сообщения.",
      "antworten": [
        { "id": "S049-R", "text": "Верно", "korrekt": false },
        { "id": "S049-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Цифровая подпись обеспечивает *целостность* (сообщение не было изменено) и *подлинность* (отправитель является подлинным) сообщения, а также *неотказуемость*. Конфиденциальность достигается за счет шифрования.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S050",
      "frage": "Система управления информацией и событиями безопасности (SIEM) автоматически генерирует исправления для выявленных уязвимостей.",
      "antworten": [
        { "id": "S050-R", "text": "Верно", "korrekt": false },
        { "id": "S050-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Системы SIEM собирают, коррелируют и анализируют данные журналов и событий для генерации предупреждений безопасности. Устранение уязвимостей (установка исправлений) не является их основной функцией, а является задачей управления уязвимостями и управления исправлениями.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S051",
      "frage": "Целевой фишинг - это целенаправленная фишинговая атака на определенного человека или организацию.",
      "antworten": [
        { "id": "S051-R", "text": "Верно", "korrekt": true },
        { "id": "S051-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! В отличие от обычного фишинга, атаки целевого фишинга часто хорошо продуманы и персонализированы для повышения вероятности успеха.",
      "kategorie": "Социальная инженерия",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S052",
      "frage": "План реагирования на инциденты безопасности (SIRP) - это документ, описывающий шаги по восстановлению после физической потери данных.",
      "antworten": [
        { "id": "S052-R", "text": "Верно", "korrekt": false },
        { "id": "S052-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — SIRP описывает систематический подход к инцидентам безопасности (например, кибератакам), от обнаружения и сдерживания до восстановления. План аварийного восстановления (DRP) или план обеспечения непрерывности бизнеса (BCP) занимается восстановлением после потери данных.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S053",
      "frage": "Пятиэтапный процесс реагирования на инциденты: идентификация, сдерживание, искоренение, восстановление, извлечение уроков.",
      "antworten": [
        { "id": "S053-R", "text": "Верно", "korrekt": true },
        { "id": "S053-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Этот процесс, часто соответствующий NIST (Национальный институт стандартов и технологий), является стандартной основой для управления инцидентами безопасности. Иногда 'подготовка' добавляется в качестве нулевого шага.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S054",
      "frage": "Правило двух человек (Two-Person Rule) - это принцип безопасности, который гласит, что критическая задача всегда должна выполняться как минимум двумя людьми одновременно.",
      "antworten": [
        { "id": "S054-R", "text": "Верно", "korrekt": true },
        { "id": "S054-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Это повышает безопасность и снижает риск мошенничества или ошибок, поскольку один человек может контролировать другого. Часто используется в сочетании с 'Разделением обязанностей'.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S055",
      "frage": "Брандмауэр веб-приложений (WAF) работает на сетевом уровне (уровень 3) модели OSI.",
      "antworten": [
        { "id": "S055-R", "text": "Верно", "korrekt": false },
        { "id": "S055-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — WAF работает на прикладном уровне (уровень 7) модели OSI. Он понимает связь HTTP/HTTPS и может обнаруживать и блокировать определенные веб-атаки.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S056",
      "frage": "Алгоритм SHA-256 является криптографическим методом шифрования.",
      "antworten": [
        { "id": "S056-R", "text": "Верно", "korrekt": false },
        { "id": "S056-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — SHA-256 - это криптографическая хеш-функция, а не метод шифрования. Она генерирует хеш-значение для проверки целостности данных, но данные не могут быть восстановлены из хеш-значения.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S057",
      "frage": "Рабочая станция для цифровой криминалистики всегда должна быть подключена к Интернету для получения актуальных инструментов и данных об угрозах.",
      "antworten": [
        { "id": "S057-R", "text": "Верно", "korrekt": false },
        { "id": "S057-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Рабочая станция для цифровой криминалистики в идеале должна быть изолирована от сети (Air Gap) для обеспечения целостности доказательств и предотвращения возможной компрометации во время анализа.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S058",
      "frage": "Вишинг - это форма фишинга, которая использует голосовую связь (телефонные звонки) для обмана жертв.",
      "antworten": [
        { "id": "S058-R", "text": "Верно", "korrekt": true },
        { "id": "S058-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Это сочетание 'voice' и 'phishing'. Злоумышленники выдают себя за доверенных лиц (например, банковских служащих) для получения конфиденциальной информации.",
      "kategorie": "Социальная инженерия",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S059",
      "frage": "План обеспечения непрерывности бизнеса (BCP) в первую очередь ориентирован на быстрое восстановление ИТ-систем после сбоя.",
      "antworten": [
        { "id": "S059-R", "text": "Верно", "korrekt": false },
        { "id": "S059-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — BCP фокусируется на поддержании критически важных бизнес-функций во время и после чрезвычайной ситуации, чтобы максимально поддерживать работу. План аварийного восстановления (DRP) занимается техническим восстановлением ИТ-систем.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S060",
      "frage": "Однофакторная аутентификация (SFA) является самым безопасным методом аутентификации пользователей.",
      "antworten": [
        { "id": "S060-R", "text": "Верно", "korrekt": false },
        { "id": "S060-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — SFA (например, только пароль) является наименее безопасным методом. Многофакторная аутентификация (MFA) значительно безопаснее, поскольку она использует несколько независимых факторов для проверки личности.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S061",
      "frage": "Виртуальная частная сеть (VPN) используется для ускорения доступа в Интернет.",
      "antworten": [
        { "id": "S061-R", "text": "Верно", "korrekt": false },
        { "id": "S061-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — VPN в первую очередь используются для создания безопасного и зашифрованного соединения по небезопасной сети, такой как Интернет. Они могут даже немного замедлить доступ в Интернет, поскольку данные необходимо шифровать.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S062",
      "frage": "Технология блокчейн основана на децентрализованном, неизменяемом реестре транзакций, защищенном криптографией.",
      "antworten": [
        { "id": "S062-R", "text": "Верно", "korrekt": true },
        { "id": "S062-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Каждый 'блок' содержит криптографическую ссылку на предыдущий блок, что делает целостность данных и манипуляции практически невозможными. Это основа для криптовалют, таких как биткойн.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S063",
      "frage": "Анализатор пакетов (сниффер) может захватывать сетевой трафик только в том случае, если он установлен на целевой системе.",
      "antworten": [
        { "id": "S063-R", "text": "Верно", "korrekt": false },
        { "id": "S063-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Анализатор пакетов, такой как Wireshark, может захватывать сетевой трафик, работая в неразборчивом режиме на устройстве в том же сегменте сети. Он не обязательно должен быть установлен на целевой системе.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S064",
      "frage": "Логическая бомба - это тип вредоносного ПО, который активируется при выполнении определенных условий (например, определенной даты или определенного действия).",
      "antworten": [
        { "id": "S064-R", "text": "Верно", "korrekt": true },
        { "id": "S064-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Логические бомбы часто могут оставаться незамеченными до тех пор, пока не сработает условие срабатывания, что делает их опасной угрозой, например, при саботаже со стороны инсайдеров.",
      "kategorie": "Типы вредоносных программ",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S065",
      "frage": "Аудит безопасности - это разовая проверка безопасности организации.",
      "antworten": [
        { "id": "S065-R", "text": "Верно", "korrekt": false },
        { "id": "S065-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Хотя аудит безопасности является моментальным снимком, эффективная программа безопасности требует регулярных аудитов, а также постоянного мониторинга и улучшения состояния безопасности.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S066",
      "frage": "Многофакторная аутентификация (MFA) - это пример метода аутентификации, который использует 'то, что у вас есть'.",
      "antworten": [
        { "id": "S066-R", "text": "Верно", "korrekt": true },
        { "id": "S066-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Примерами 'того, что у вас есть' являются аппаратные токены, смарт-карты или смартфон для генерации одноразовых паролей. В сочетании с паролем (то, что вы знаете) это дает MFA.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S067",
      "frage": "Брандмауэр с фильтрацией пакетов работает на прикладном уровне (уровень 7) и может проверять содержимое HTTP-запросов.",
      "antworten": [
        { "id": "S067-R", "text": "Верно", "korrekt": false },
        { "id": "S067-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Простой пакетный фильтр работает на уровне 3 (сетевой) и уровне 4 (транспортный) модели OSI. Он принимает решения на основе IP-адресов и номеров портов. WAF (брандмауэр веб-приложений) работает на уровне 7.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S068",
      "frage": "Атака методом перебора - это форма криптографической атаки, при которой предпринимается попытка найти ключ путем систематического перебора всех возможных комбинаций.",
      "antworten": [
        { "id": "S068-R", "text": "Верно", "korrekt": true },
        { "id": "S068-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Хотя теоретически перебор всегда работает, необходимое время становится астрономически долгим для достаточно длинных и сложных ключей, что делает его непрактичным на практике.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S069",
      "frage": "Команда `netstat -an` в Linux показывает активные сетевые подключения и открытые порты.",
      "antworten": [
        { "id": "S069-R", "text": "Верно", "korrekt": true },
        { "id": "S069-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Опция '-a' показывает все подключения (прослушивающие и не прослушивающие), а '-n' показывает адреса и номера портов в числовом виде. Это полезный инструмент для диагностики сети и анализа безопасности.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S070",
      "frage": "Подглядывание через плечо (Shoulder Surfing) - это форма социальной инженерии, которая позволяет удаленно подсматривать пароли или PIN-коды с помощью камер.",
      "antworten": [
        { "id": "S070-R", "text": "Верно", "korrekt": false },
        { "id": "S070-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Подглядывание через плечо относится к прямому наблюдению, например, через плечо, когда кто-то вводит пароль или PIN-код. Подглядывание с помощью камер было бы скорее формой наблюдения.",
      "kategorie": "Социальная инженерия",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S071",
      "frage": "Система управления информацией и событиями безопасности (SIEM) в первую очередь отвечает за управление физическими инцидентами безопасности.",
      "antworten": [
        { "id": "S071-R", "text": "Верно", "korrekt": false },
        { "id": "S071-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Системы SIEM предназначены для управления инцидентами кибербезопасности и анализа цифровых данных журналов. Физические инциденты безопасности обычно обрабатываются другими системами или процессами.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S072",
      "frage": "Принцип 'необходимости знать' гласит, что каждый сотрудник должен иметь доступ ко всей информации для эффективного выполнения своей работы.",
      "antworten": [
        { "id": "S072-R", "text": "Верно", "korrekt": false },
        { "id": "S072-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Принцип 'необходимости знать' - это концепция безопасности, которая гласит, что сотрудники должны иметь доступ только к той информации, которая абсолютно необходима для выполнения их конкретной задачи, и не более. Это минимизирует риск утечки информации.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S073",
      "frage": "IDS (система обнаружения вторжений) - это пассивное решение безопасности.",
      "antworten": [
        { "id": "S073-R", "text": "Верно", "korrekt": true },
        { "id": "S073-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! IDS отслеживает трафик и генерирует оповещения о подозрительной активности, но не вмешивается активно в трафик данных. В отличие от этого, IPS (система предотвращения вторжений) активно блокирует атаки.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S074",
      "frage": "Кейлоггеры - это тип вредоносного ПО, которое записывает нажатия клавиш пользователя.",
      "antworten": [
        { "id": "S074-R", "text": "Верно", "korrekt": true },
        { "id": "S074-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Кейлоггеры часто используются для кражи паролей, номеров кредитных карт и другой конфиденциальной информации. Они могут быть реализованы как программное обеспечение или оборудование.",
      "kategorie": "Типы вредоносных программ",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S075",
      "frage": "Криптографический хеш-алгоритм MD5 сегодня рекомендуется как безопасный для проверки целостности данных.",
      "antworten": [
        { "id": "S075-R", "text": "Верно", "korrekt": false },
        { "id": "S075-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — MD5 (Message-Digest Algorithm 5) считается криптографически взломанным из-за его уязвимости к коллизиям (разные входные данные производят один и тот же хеш) и больше не должен использоваться в целях безопасности, таких как проверка целостности. SHA-256 является безопасной альтернативой.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S076",
      "frage": "Аудит безопасности - это всесторонняя техническая проверка системы или сети на наличие уязвимостей и ошибок конфигурации.",
      "antworten": [
        { "id": "S076-R", "text": "Верно", "korrekt": true },
        { "id": "S076-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Это формальное, систематическое обследование для оценки соответствия политикам безопасности, стандартам и лучшим практикам. В отличие от пентеста, здесь не проводятся активные атаки.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S077",
      "frage": "Приманка - это метод социальной инженерии, при котором злоумышленник подготавливает физические носители (например, USB-накопители) с вредоносным ПО и размещает их в общественных местах.",
      "antworten": [
        { "id": "S077-R", "text": "Верно", "korrekt": true },
        { "id": "S077-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Злоумышленник надеется, что кто-то найдет носитель, подключит его к своей системе из любопытства и таким образом активирует вредоносное ПО. Часто на USB-накопители наклеивают привлекательные этикетки.",
      "kategorie": "Социальная инженерия",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S078",
      "frage": "Владелец данных - это лицо, ответственное за техническую реализацию и обслуживание систем безопасности.",
      "antworten": [
        { "id": "S078-R", "text": "Верно", "korrekt": false },
        { "id": "S078-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Владелец данных - это лицо (или отдел), которое несет деловую ответственность за данные и принимает решения об их использовании и классификации. Техническая ответственность лежит на хранителе данных.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S079",
      "frage": "Бастион-хост - это специально защищенная система, которая служит безопасной точкой перехода в сети и предлагает только абсолютно необходимые службы.",
      "antworten": [
        { "id": "S079-R", "text": "Верно", "korrekt": true },
        { "id": "S079-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Бастион-хосты часто развертываются в зонах DMZ для обеспечения высокого уровня безопасности и контроля доступа к внутренним сетям. Они высоко защищены и контролируются.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S080",
      "frage": "Оператор XOR является основной операцией в криптографии, которая может использоваться для шифрования и дешифрования.",
      "antworten": [
        { "id": "S080-R", "text": "Верно", "korrekt": true },
        { "id": "S080-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! XOR (исключающее ИЛИ) обратим (A XOR B = C, тогда C XOR B = A) и лежит в основе многих простых алгоритмов шифрования, таких как одноразовый блокнот, но обеспечивает безопасность только в том случае, если ключ действительно случайный и используется только один раз.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S081",
      "frage": "Система управления информацией и событиями безопасности (SIEM) коррелирует события и журналы из различных источников для выявления угроз.",
      "antworten": [
        { "id": "S081-R", "text": "Верно", "korrekt": true },
        { "id": "S081-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Коррелируя события с межсетевых экранов, конечных точек, серверов и приложений, SIEM может обнаруживать атаки, которые остались бы незамеченными при изолированном просмотре отдельных журналов.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S082",
      "frage": "Смишинг - это форма фишинга, которая происходит исключительно через социальные сети.",
      "antworten": [
        { "id": "S082-R", "text": "Верно", "korrekt": false },
        { "id": "S082-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Смишинг - это фишинг через SMS (Short Message Service). Это сочетание 'SMS' и 'фишинг'.",
      "kategorie": "Социальная инженерия",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S083",
      "frage": "Анализ влияния на бизнес (BIA) определяет наиболее важные бизнес-функции и последствия сбоя для этих функций.",
      "antworten": [
        { "id": "S083-R", "text": "Верно", "korrekt": true },
        { "id": "S083-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! BIA является важной частью планирования непрерывности бизнеса и помогает устанавливать приоритеты для восстановления, определяя цели восстановления (RTO, RPO).",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S084",
      "frage": "Управление привилегированным доступом (PAM) фокусируется на управлении и мониторинге обычных учетных записей пользователей.",
      "antworten": [
        { "id": "S084-R", "text": "Верно", "korrekt": false },
        { "id": "S084-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — PAM фокусируется на управлении и мониторинге *привилегированных* учетных записей пользователей (например, администраторов, root), поскольку они представляют наибольшую угрозу в случае компрометации.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S085",
      "frage": "Виртуальная локальная сеть (VLAN) - это физически отделенный сетевой сегмент.",
      "antworten": [
        { "id": "S085-R", "text": "Верно", "korrekt": false },
        { "id": "S085-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — VLAN - это *логическое* разделение сетевых сегментов в одной и той же физической сети (часто одного коммутатора). Физическое разделение потребовало бы выделенного оборудования.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S086",
      "frage": "SSL/TLS-сертификат используется для проверки подлинности веб-сервера и шифрования связи.",
      "antworten": [
        { "id": "S086-R", "text": "Верно", "korrekt": true },
        { "id": "S086-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Когда вы посещаете веб-сайт HTTPS, SSL/TLS-сертификат гарантирует, что вы общаетесь с предполагаемым сервером и что ваши данные остаются конфиденциальными.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S087",
      "frage": "Команда `whoami` в Linux отображает IP-адрес текущего пользователя.",
      "antworten": [
        { "id": "S087-R", "text": "Верно", "korrekt": false },
        { "id": "S087-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — `whoami` отображает имя пользователя текущего пользователя. Для IP-адреса системы используются такие команды, как `ip addr` или `ifconfig`.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S088",
      "frage": "Китобойный промысел - это целенаправленная фишинговая атака, специально нацеленная на высокопоставленных руководителей в организации.",
      "antworten": [
        { "id": "S088-R", "text": "Верно", "korrekt": true },
        { "id": "S088-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Также известно как мошенничество с генеральным директором или компрометация деловой электронной почты (BEC). Атаки часто чрезвычайно хорошо подготовлены и могут нанести значительный финансовый ущерб.",
      "kategorie": "Социальная инженерия",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S089",
      "frage": "Группа реагирования на инциденты (IRT) отвечает за превентивную безопасность в компании.",
      "antworten": [
        { "id": "S089-R", "text": "Верно", "korrekt": false },
        { "id": "S089-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — IRT (или CSIRT) отвечает за реагирование на инциденты безопасности, то есть когда инцидент *уже* произошел. Превентивная безопасность - это задача центра операций безопасности (SOC) или всей команды безопасности.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S090",
      "frage": "Наименьшие привилегии - это концепция, при которой пользователи по умолчанию получают все права доступа, которые при необходимости ограничиваются вручную.",
      "antworten": [
        { "id": "S090-R", "text": "Верно", "korrekt": false },
        { "id": "S090-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Принцип наименьших привилегий гласит, что пользователи и процессы должны получать только минимально необходимые права для выполнения своих задач, по умолчанию. Все остальное запрещено.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S091",
      "frage": "Система обнаружения вторжений (IDS) всегда должна размещаться в сети для анализа трафика.",
      "antworten": [
        { "id": "S091-R", "text": "Верно", "korrekt": false },
        { "id": "S091-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — IDS может быть размещен как в сети (в пути данных), так и вне полосы пропускания (через порт SPAN или сетевой ответвитель, только для мониторинга). Размещение в сети типично для систем IPS.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S092",
      "frage": "Transport Layer Security (TLS) является преемником SSL и используется для безопасной связи по компьютерным сетям.",
      "antworten": [
        { "id": "S092-R", "text": "Верно", "korrekt": true },
        { "id": "S092-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! TLS - это протокол, который лежит в основе HTTPS, SMTPS и других безопасных протоколов связи. Он обеспечивает конфиденциальность, целостность и подлинность.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S093",
      "frage": "Metasploit Framework - это инструмент для проведения автоматического сканирования уязвимостей.",
      "antworten": [
        { "id": "S093-R", "text": "Верно", "korrekt": false },
        { "id": "S093-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Metasploit - это мощная платформа для тестирования на проникновение и разработки эксплойтов. Она предназначена не в первую очередь для сканирования, а для использования известных уязвимостей и пост-эксплуатации.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S094",
      "frage": "Атака 'водопой' нацелена на компрометацию учетных записей электронной почты целевой группы.",
      "antworten": [
        { "id": "S094-R", "text": "Верно", "korrekt": false },
        { "id": "S094-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Атака 'водопой' компрометирует веб-сайт, часто посещаемый целевой группой, чтобы заразить жертв, когда они заходят на подготовленный сайт. Это как засада у 'водопоя'.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S095",
      "frage": "Система управления информацией и событиями безопасности (SIEM) автоматически генерирует исправления для выявленных уязвимостей.",
      "antworten": [
        { "id": "S095-R", "text": "Верно", "korrekt": false },
        { "id": "S095-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Системы SIEM собирают, коррелируют и анализируют данные журналов и событий для генерации предупреждений безопасности. Устранение уязвимостей (установка исправлений) не является их основной функцией, а является задачей управления уязвимостями и управления исправлениями.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S096",
      "frage": "Разделение обязанностей - это принцип безопасности, который предотвращает выполнение критически важной задачи одним человеком.",
      "antworten": [
        { "id": "S096-R", "text": "Верно", "korrekt": true },
        { "id": "S096-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Это снижает риск мошенничества, ошибок и злоупотребления привилегиями, разделяя критически важные задачи на несколько этапов, которые должны выполняться разными людьми.",
      "kategorie": "Управление идентификацией и доступом",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S097",
      "frage": "Система обнаружения и реагирования на конечных точках (EDR) обеспечивает комплексную защиту от вредоносного ПО на конечных точках.",
      "antworten": [
        { "id": "S097-R", "text": "Верно", "korrekt": true },
        { "id": "S097-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Системы EDR выходят за рамки традиционной антивирусной защиты, постоянно отслеживая активность на конечных точках, обнаруживая угрозы, реагируя на них и предоставляя анализ.",
      "kategorie": "Сетевая безопасность",
      "lang": "ru",
      "schwierigkeit": "средне"
    },
    {
      "id": "S098",
      "frage": "Служба аутентификации Kerberos основана на симметричном методе шифрования.",
      "antworten": [
        { "id": "S098-R", "text": "Верно", "korrekt": true },
        { "id": "S098-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Kerberos использует симметричные ключи для аутентификации и защиты связи между клиентом и сервером. Это широко используемый протокол сетевой аутентификации.",
      "kategorie": "Криптография",
      "lang": "ru",
      "schwierigkeit": "сложно"
    },
    {
      "id": "S099",
      "frage": "Команда `ls -la` в Linux отображает все файлы, включая скрытые, и их разрешения.",
      "antworten": [
        { "id": "S099-R", "text": "Верно", "korrekt": true },
        { "id": "S099-F", "text": "Неверно", "korrekt": false }
      ],
      "erklaerung": "Верно! Это основная команда для изучения файловых систем и разрешений, часто используемая при анализе безопасности для поиска подозрительных или скрытых файлов.",
      "kategorie": "Инструменты безопасности",
      "lang": "ru",
      "schwierigkeit": "легко"
    },
    {
      "id": "S100",
      "frage": "В рамках криминалистического анализа разрешается изменять доказательства для ускорения процесса анализа.",
      "antworten": [
        { "id": "S100-R", "text": "Верно", "korrekt": false },
        { "id": "S100-F", "text": "Неверно", "korrekt": true }
      ],
      "erklaerung": "Неверно — Целостность доказательств имеет первостепенное значение в цифровой криминалистике. Любое изменение строго запрещено и может сделать цепочку доказательств недействительной. Необходимо создать точную копию (криминалистический образ) и проанализировать ее.",
      "kategorie": "Управление угрозами",
      "lang": "ru",
      "schwierigkeit": "средне"
    }
  ]
}
